StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_ops.c
/******************************************************************************
 *
 * Copyright(c) 2015 - 2017 Realtek Corporation.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 *****************************************************************************/
#define _RTL8730A_OPS_C_

#include <drv_types.h>		/* basic_types.h, rtw_io.h and etc. */
#include <rtw_xmit.h>		/* struct xmit_priv */
#ifdef DBG_CONFIG_ERROR_DETECT
#include <rtw_sreset.h>
#endif /* DBG_CONFIG_ERROR_DETECT */
#include <hal_data.h>		/* PHAL_DATA_TYPE, GET_HAL_DATA() */
#include <hal_com.h>		/* dump_chip_info() and etc. */
#include "../hal_halmac.h"	/* GET_RX_DESC_XXX_8730A() */
#include "rtl8730a.h"
#include "rtl8730a_hal.h"
#include <rtl8730a_spec.h>
#include <sysreg_lsys.h>
#include "hal8730a_fw.h"
#include "rtl8730a_recv.h"

const struct afrf_info afrf_info_8814b[] = {
	[RATEID_IDX_BGN_40M_2SS] = {
		.arfr_cck_en = 1, .arfr_ofdm_en = 1, .arfr_ht_en = 1
	},
	[RATEID_IDX_BGN_40M_1SS] = {
		.arfr_cck_en = 1, .arfr_ofdm_en = 1, .arfr_ht_en = 1
	},
	[RATEID_IDX_BGN_20M_2SS_BN] = {
		.arfr_cck_en = 1, .arfr_ofdm_en = 1, .arfr_ht_en = 1
	},
	[RATEID_IDX_BGN_20M_1SS_BN] = {
		.arfr_cck_en = 1, .arfr_ofdm_en = 1, .arfr_ht_en = 1
	},
	[RATEID_IDX_BGN_3SS] = {
		.arfr_cck_en = 1, .arfr_ofdm_en = 1, .arfr_ht_en = 1
	},
	[RATEID_IDX_BGN_4SS] = {
		.arfr_cck_en = 1, .arfr_ofdm_en = 1, .arfr_ht_en = 1
	},
	[RATEID_IDX_GN_N2SS] = {
		.arfr_cck_en = 0, .arfr_ofdm_en = 1, .arfr_ht_en = 1
	},
	[RATEID_IDX_GN_N1SS] = {
		.arfr_cck_en = 0, .arfr_ofdm_en = 1, .arfr_ht_en = 1
	},
	[RATEID_IDX_BG] = {
		.arfr_cck_en = 1, .arfr_ofdm_en = 1, .arfr_ht_en = 0
	},
	[RATEID_IDX_G] = {
		.arfr_cck_en = 0, .arfr_ofdm_en = 1, .arfr_ht_en = 0
	},
	[RATEID_IDX_B] = {
		.arfr_cck_en = 1, .arfr_ofdm_en = 0, .arfr_ht_en = 0
	},
	[RATEID_IDX_VHT_2SS] = {
		.arfr_cck_en = 0, .arfr_ofdm_en = 1, .arfr_ht_en = 0
	},
	[RATEID_IDX_VHT_1SS] = {
		.arfr_cck_en = 0, .arfr_ofdm_en = 1, .arfr_ht_en = 0
	},
	[RATEID_IDX_MIX1] = {
		.arfr_cck_en = 0, .arfr_ofdm_en = 1, .arfr_ht_en = 0
	},
	[RATEID_IDX_MIX2] = {
		.arfr_cck_en = 0, .arfr_ofdm_en = 1, .arfr_ht_en = 0
	},
	[RATEID_IDX_VHT_3SS] = {
		.arfr_cck_en = 0, .arfr_ofdm_en = 1, .arfr_ht_en = 0
	},
	[RATEID_IDX_VHT_4SS] = {
		.arfr_cck_en = 0, .arfr_ofdm_en = 1, .arfr_ht_en = 0
	},
};

static const struct hw_port_reg port_cfg[] = {
	/*port 0*/
	{
		.net_type = (REG_CR_8730A + 2),
		.net_type_shift = 0,
		.macaddr = REG_MACID_8730A,
		.bssid = REG_BSSID_8730A,
		.ps_aid = REG_BCN_PSR_RPT_8730A,
		.ta = REG_TRANSMIT_ADDRSS_0_8730A,
	},
	/*port 1*/
	{
		.net_type = (REG_CR_8730A + 2),
		.net_type_shift = 2,
		.macaddr = REG_MACID1_8730A,
		.bssid = REG_BSSID1_8730A,
		.ps_aid = REG_BCN_PSR_RPT1_8730A,
		.ta = REG_TRANSMIT_ADDRSS_1_8730A,
	},
};

static u32 hw_bcn_ctrl_addr(_adapter *adapter, u8 hw_port)
{
	struct hal_spec_t *hal_spec = GET_HAL_SPEC(adapter);
	u32 addr = 0;

	if (hw_port >= hal_spec->port_num) {
		RTW_ERR(FUNC_ADPT_FMT" HW Port(%d) invalid\n", FUNC_ADPT_ARG(adapter), hw_port);
		rtw_warn_on(1);
		goto exit;
	}

	if (hw_port == HW_PORT0) {
		addr = REG_BCN_CTRL_PORT0_8730A;
	} else if (hw_port == HW_PORT1) {
		addr = REG_BCN_CTRL_PORT1_8730A;
	}

exit:
	return addr;
}

#ifdef CONFIG_CLIENT_PORT_CFG
static void hw_bcn_ctrl_set(_adapter *adapter, u8 hw_port, u8 bcn_ctl_val)
{
	u32 bcn_ctl_addr = 0;

	if (hw_port >= MAX_HW_PORT) {
		RTW_ERR(FUNC_ADPT_FMT" HW Port(%d) invalid\n", FUNC_ADPT_ARG(adapter), hw_port);
		rtw_warn_on(1);
		return;
	}

	rtw_enter_protsel_port(adapter, hw_port);

	if (hw_port == HW_PORT0) {
		bcn_ctl_addr = REG_BCN_CTRL_PORT0_8730A;
	} else if (hw_port == HW_PORT1) {
		bcn_ctl_addr = REG_BCN_CTRL_PORT1_8730A;
	}
	rtw_write8(adapter, bcn_ctl_addr, bcn_ctl_val);

	rtw_leave_protsel_port(adapter);
}
#endif

static void hw_bcn_ctrl_add(_adapter *adapter, u8 hw_port, u8 bcn_ctl_val)
{
	u32 bcn_ctl_addr = 0;
	u8 val8 = 0;

	if (hw_port >= MAX_HW_PORT) {
		RTW_ERR(FUNC_ADPT_FMT" HW Port(%d) invalid\n", FUNC_ADPT_ARG(adapter), hw_port);
		rtw_warn_on(1);
		return;
	}

	rtw_enter_protsel_port(adapter, hw_port);

	if (hw_port == HW_PORT0) {
		bcn_ctl_addr = REG_BCN_CTRL_PORT0_8730A;
	} else if (hw_port == HW_PORT1) {
		bcn_ctl_addr = REG_BCN_CTRL_PORT1_8730A;
	}
	val8 = rtw_read8(adapter, bcn_ctl_addr) | bcn_ctl_val;
	rtw_write8(adapter, bcn_ctl_addr, val8);

	rtw_leave_protsel_port(adapter);
}

static void hw_bcn_ctrl_clr(_adapter *adapter, u8 hw_port, u8 bcn_ctl_val)
{
	u32 bcn_ctl_addr = 0;
	u8 val8 = 0;

	if (hw_port >= MAX_HW_PORT) {
		RTW_ERR(FUNC_ADPT_FMT" HW Port(%d) invalid\n", FUNC_ADPT_ARG(adapter), hw_port);
		rtw_warn_on(1);
		return;
	}

	rtw_enter_protsel_port(adapter, hw_port);

	if (hw_port == HW_PORT0) {
		bcn_ctl_addr = REG_BCN_CTRL_PORT0_8730A;
	} else if (hw_port == HW_PORT1) {
		bcn_ctl_addr = REG_BCN_CTRL_PORT1_8730A;
	}
	val8 = rtw_read8(adapter, bcn_ctl_addr);
	val8 &= ~bcn_ctl_val;
	rtw_write8(adapter, bcn_ctl_addr, val8);

	rtw_leave_protsel_port(adapter);
}

static void read_chip_version(PADAPTER adapter)
{
	PHAL_DATA_TYPE hal;
	u32 value32;

	hal = GET_HAL_DATA(adapter);

	value32 = rtw_read32(adapter, REG_SYS_CONFIG0_8730A);
	hal->version_id.ICType = CHIP_8730A;
	hal->version_id.VendorType = BIT_GET_VENDOR_ID_V1_8730A(value32);
	switch (hal->version_id.VendorType) {
	case 0:
		hal->version_id.VendorType = CHIP_VENDOR_TSMC;
		break;
	case 1:
		hal->version_id.VendorType = CHIP_VENDOR_SMIC;
		break;
	case 2:
		hal->version_id.VendorType = CHIP_VENDOR_UMC;
		break;
	}

	value32 = rtw_sys_read32(adapter, SYSTEM_CTRL_BASE_LP, REG_LSYS_SYSTEM_CFG0);
	if (LSYS_GET_HW_CHIP_TYPE(value32) == 0) {
		hal->version_id.ChipType = TEST_CHIP;
	} else if (LSYS_GET_HW_CHIP_TYPE(value32) == 1) {
		hal->version_id.ChipType = FPGA;
	}
	hal->version_id.CUTVersion = LSYS_GET_HW_CHIP_ID(value32);

	hal->version_id.RFType = RF_TYPE_1T1R;

	dump_chip_info(hal->version_id);
}

