StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_ops.c
/*
 * Return:
 *	_TRUE	valid ID
 *	_FALSE	invalid ID
 */
static u8 Hal_EfuseParseIDCode(PADAPTER adapter, u8 *map)
{
	u16 EEPROMId;


	/* Check 0x8129 again for making sure autoload status!! */
	EEPROMId = le16_to_cpu(*(u16 *)map);
	RTW_INFO("EEPROM ID = 0x%04x\n", EEPROMId);
	if (EEPROMId == RTL_EEPROM_ID) {
		return _TRUE;
	}

	RTW_WARN("EEPROM ID is invalid!!\n");
	return _FALSE;
}

static void Hal_EfuseParseEEPROMVer(PADAPTER adapter, u8 *map, u8 mapvalid)
{
	PHAL_DATA_TYPE hal = GET_HAL_DATA(adapter);


	if (_TRUE == mapvalid) {
		hal->EEPROMVersion = map[EEPROM_VERSION_8730A];
	} else {
		hal->EEPROMVersion = 1;
	}

	RTW_INFO("EEPROM Version = %d\n", hal->EEPROMVersion);
}

static int Hal_EfuseParseTxPowerInfo(PADAPTER adapter, u8 *map, u8 mapvalid)
{
	PHAL_DATA_TYPE hal = GET_HAL_DATA(adapter);
	u8 tpt_mode = (map[EEPROM_TX_PWR_CAL_RATE_8730A] & 0xF0) >> 4;
	int ret = _FAIL;

	if (GetRegPowerTrackingType(adapter) != 64) {
		tpt_mode = GetRegPowerTrackingType(adapter);
		RTW_INFO("%s force tpt_mode=%u\n", __func__, tpt_mode);
	}

#ifdef CONFIG_TXPWR_PG_WITH_PWR_IDX
	if (tpt_mode <= 3) { /* 0~3: thermal */
		hal->txpwr_pg_mode = TXPWR_PG_WITH_PWR_IDX;
		goto parse_tpt_mode_done;
	}
#endif

#ifdef CONFIG_TXPWR_PG_WITH_TSSI_OFFSET
	if (tpt_mode >= 4 && tpt_mode <= 7) { /* 4~7: TSSI */
		hal->txpwr_pg_mode = TXPWR_PG_WITH_TSSI_OFFSET;
		goto parse_tpt_mode_done;
	}
#endif

	RTW_ERR("%s unknown tpt_mode=%u\n", __func__, tpt_mode);
	goto exit;

parse_tpt_mode_done:
	RTW_INFO("%s tpt_mode=%u, PG with %s\n", __func__
		 , tpt_mode, txpwr_pg_mode_str(hal->txpwr_pg_mode));

	if ((_TRUE == mapvalid) && (map[EEPROM_RF_BOARD_OPTION_8730A] != 0xFF)) {
		hal->EEPROMRegulatory = map[EEPROM_RF_BOARD_OPTION_8730A] & 0x7;        /* bit0~2 */
	} else {
		hal->EEPROMRegulatory = EEPROM_DEFAULT_BOARD_OPTION & 0x7;        /* bit0~2 */
	}
	RTW_INFO("EEPROM Regulatory=0x%02x\n", hal->EEPROMRegulatory);

	ret = _SUCCESS;

exit:
	return ret;
}

static void Hal_EfuseParseBoardType(PADAPTER adapter, u8 *map, u8 mapvalid)
{
	PHAL_DATA_TYPE hal = GET_HAL_DATA(adapter);


	if ((_TRUE == mapvalid) && (map[EEPROM_RF_BOARD_OPTION_8730A] != 0xFF)) {
		hal->InterfaceSel = (map[EEPROM_RF_BOARD_OPTION_8730A] & 0xE0) >> 5;
	} else {
		hal->InterfaceSel = (EEPROM_DEFAULT_BOARD_OPTION & 0xE0) >> 5;
	}

	RTW_INFO("EEPROM Board Type=0x%02x\n", hal->InterfaceSel);
}

static void Hal_EfuseParseBTCoexistInfo(PADAPTER adapter, u8 *map, u8 mapvalid)
{
	PHAL_DATA_TYPE hal = GET_HAL_DATA(adapter);
	u8 setting;
	u32 tmpu4;

	if ((_TRUE == mapvalid) && (map[EEPROM_RF_BOARD_OPTION_8730A] != 0xFF)) {
		/* 0xc1[7:5] = 0x01 */
		if (((map[EEPROM_RF_BOARD_OPTION_8730A] & 0xe0) >> 5) == 0x01) {
			hal->EEPROMBluetoothCoexist = _TRUE;
		} else {
			hal->EEPROMBluetoothCoexist = _FALSE;
		}
	} else {
		hal->EEPROMBluetoothCoexist = _FALSE;
	}

	hal->EEPROMBluetoothType = BT_RTL8730A;

	setting = map[EEPROM_RF_BT_SETTING_8730A];
	if ((_TRUE == mapvalid) && (setting != 0xFF)) {
		hal->EEPROMBluetoothAntNum = setting & BIT(0);
		/*
		 * EFUSE_0xC3[6] == 0, S1(Main)-RF_PATH_A;
		 * EFUSE_0xC3[6] == 1, S0(Aux)-RF_PATH_B
		 */
		hal->ant_path = (setting & BIT(6)) ? RF_PATH_B : RF_PATH_A;
	} else {
		hal->EEPROMBluetoothAntNum = Ant_x2;
		hal->ant_path = RF_PATH_A;
	}

	RTW_INFO("EEPROM %s BT-coex, ant_num=%d\n",
		 hal->EEPROMBluetoothCoexist == _TRUE ? "Enable" : "Disable",
		 hal->EEPROMBluetoothAntNum == Ant_x2 ? 2 : 1);
}

static void Hal_EfuseParseChnlPlan(PADAPTER adapter, u8 *map, u8 autoloadfail)
{
	hal_com_config_channel_plan(
		adapter,
		map ? &map[EEPROM_COUNTRY_CODE_8730A] : NULL,
		map ? map[EEPROM_ChannelPlan_8730A] : 0xFF,
		RTW_CHPLAN_6G_NULL,
		autoloadfail
	);
}

static void Hal_EfuseParseXtal(PADAPTER adapter, u8 *map, u8 mapvalid)
{
	PHAL_DATA_TYPE hal = GET_HAL_DATA(adapter);


	if ((_TRUE == mapvalid) && map[EEPROM_XTAL_8730A] != 0xFF) {
		hal->crystal_cap = map[EEPROM_XTAL_8730A];
	} else {
		hal->crystal_cap = EEPROM_Default_CrystalCap_8730A;
	}

	RTW_INFO("EEPROM crystal_cap=0x%02x\n", hal->crystal_cap);
}

static void Hal_EfuseParseThermalMeter(PADAPTER adapter, u8 *map, u8 mapvalid)
{
	PHAL_DATA_TYPE hal = GET_HAL_DATA(adapter);

	/* ThermalMeter (PATH A) from EEPROM */
	if ((mapvalid == _TRUE) && (map[EEPROM_THERMAL_METER_8730A] != 0xFF)) {
		hal->eeprom_thermal_meter = map[EEPROM_THERMAL_METER_8730A];
	} else {
		hal->eeprom_thermal_meter = EEPROM_Default_ThermalMeter_8730A;
		hal->odmpriv.rf_calibrate_info.is_apk_thermal_meter_ignore = _TRUE;
	}

	RTW_INFO("EEPROM ThermalMeter=0x%02x\n", hal->eeprom_thermal_meter);
}

static void Hal_EfuseParsePathSelection(PADAPTER adapter, u8 *map, u8 mapvalid)
{
	PHAL_DATA_TYPE hal = GET_HAL_DATA(adapter);
	u8 trx_path_bmp = map[EEPROM_RF_ANTENNA_OPT_8730A];

	if (!mapvalid) {
		return;
	}

	switch (trx_path_bmp) {
	case 0x11: /* 1T1R - TX:A,>-----RX:A */
	case 0x22: /* 1T1R - TX:B,>-----RX:B */
		hal->eeprom_trx_path_bmp = trx_path_bmp;
		RTW_INFO("EEPROM efuse[0x%x]=0x%02x is valid\n"
			 , EEPROM_RF_ANTENNA_OPT_8730A, trx_path_bmp);
		break;
	default:
		RTW_INFO("EEPROM efuse[0x%x]=0x%02x is unknown type\n"
			 , EEPROM_RF_ANTENNA_OPT_8730A, trx_path_bmp);
	}
}

static void Hal_EfuseParseAntennaDiversity(PADAPTER adapter, u8 *map, u8 mapvalid)
{
#ifdef CONFIG_ANTENNA_DIVERSITY
	PHAL_DATA_TYPE hal = GET_HAL_DATA(adapter);
	struct registry_priv *registry_par = &adapter->registrypriv;


	if (hal->EEPROMBluetoothAntNum == Ant_x1) {
		hal->AntDivCfg = 0;
	} else {
		if (registry_par->antdiv_cfg == 2) { /* 0:OFF , 1:ON, 2:By EFUSE */
			hal->AntDivCfg = 1;
		} else {
			hal->AntDivCfg = registry_par->antdiv_cfg;
		}
	}

	/* If TRxAntDivType is AUTO in advanced setting, use EFUSE value instead. */
	if (registry_par->antdiv_type == 0) {
		hal->TRxAntDivType = map[EEPROM_RFE_OPTION_8730A];
		if (hal->TRxAntDivType == 0xFF) {
			hal->TRxAntDivType = S0S1_SW_ANTDIV;        /* internal switch S0S1 */
		} else if (hal->TRxAntDivType == 0x10) {
			hal->TRxAntDivType = S0S1_SW_ANTDIV;        /* internal switch S0S1 */
		} else if (hal->TRxAntDivType == 0x11) {
			hal->TRxAntDivType = S0S1_SW_ANTDIV;        /* internal switch S0S1 */
		} else
			RTW_INFO("EEPROM efuse[0x%x]=0x%02x is unknown type\n",
				 EEPROM_RFE_OPTION_8730A, hal->TRxAntDivType);
	} else {
		hal->TRxAntDivType = registry_par->antdiv_type;
	}

