StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_ops.c
	RTW_INFO("EEPROM AntDivCfg=%d, AntDivType=%d\n",
		 hal->AntDivCfg, hal->TRxAntDivType);
#endif /* CONFIG_ANTENNA_DIVERSITY */
}

static void Hal_EfuseParseCustomerID(PADAPTER adapter, u8 *map, u8 mapvalid)
{
	PHAL_DATA_TYPE hal = GET_HAL_DATA(adapter);


	if (_TRUE == mapvalid) {
		hal->EEPROMCustomerID = map[EEPROM_CustomID_8730A];
	} else {
		hal->EEPROMCustomerID = 0;
	}
	RTW_INFO("EEPROM Customer ID=0x%02x\n", hal->EEPROMCustomerID);
}

static void Hal_DetectWoWMode(PADAPTER adapter)
{
#if defined(CONFIG_WOWLAN) || defined(CONFIG_AP_WOWLAN)
	adapter_to_pwrctl(adapter)->bSupportRemoteWakeup = _TRUE;
#else /* !(CONFIG_WOWLAN || CONFIG_AP_WOWLAN) */
	adapter_to_pwrctl(adapter)->bSupportRemoteWakeup = _FALSE;
#endif /* !(CONFIG_WOWLAN || CONFIG_AP_WOWLAN) */

	RTW_INFO("EEPROM SupportRemoteWakeup=%d\n", adapter_to_pwrctl(adapter)->bSupportRemoteWakeup);
}

static u8 Hal_ReadRFEType(PADAPTER adapter, u8 *map, u8 mapvalid)
{
	PHAL_DATA_TYPE hal = GET_HAL_DATA(adapter);


	/* check registry value */
	if (GetRegRFEType(adapter) != CONFIG_RTW_RFE_TYPE) {
		hal->rfe_type = GetRegRFEType(adapter);
		goto exit;
	}

	if (mapvalid) {
		/* check efuse map */
		hal->rfe_type = ReadLE1Byte(&map[EEPROM_RFE_OPTION_8730A]);
		if (0xFF != hal->rfe_type) {
			goto exit;
		}
	}

	/* error handle */
	hal->rfe_type = 0;

	/* If ignore incorrect rfe_type may cause card drop. */
	/* it's DIFFICULT do debug especially on COB project */
	RTW_ERR("\n\nEmpty EFUSE with unknown REF type!!\n\n");
	RTW_ERR("please program efuse or specify correct RFE type.\n");
	RTW_ERR("cmd: insmod rtl8730a.ko rtw_RFE_type=<rfe_type>\n\n");

	return _FAIL;

exit:
	RTW_INFO("EEPROM rfe_type=0x%x\n", hal->rfe_type);
	return _SUCCESS;
}

static void Hal_EfuseParsePackageType(PADAPTER adapter, u8 *map, u8 mapvalid)
{
}

#if 0
static void Hal_EfuseParsePABias(PADAPTER adapter)
{
	struct hal_com_data *hal;
	u8 data[2] = {0xFF, 0xFF};
	u8 ret;


	ret = rtw_efuse_access(adapter, 0, 0x3D7, 2, data);
	if (_FAIL == ret) {
		RTW_ERR("%s: Fail to read PA Bias from eFuse!\n", __FUNCTION__);
		return;
	}

	hal = GET_HAL_DATA(adapter);
	hal->efuse0x3d7 = data[0];	/* efuse[0x3D7] */
	hal->efuse0x3d8 = data[1];	/* efuse[0x3D8] */

	RTW_INFO("EEPROM efuse[0x3D7]=0x%x\n", hal->efuse0x3d7);
	RTW_INFO("EEPROM efuse[0x3D8]=0x%x\n", hal->efuse0x3d8);
}
#endif

/*
 * Description:
 *	Collect all information from efuse or files.
 *	This function will do
 *	1. Read registers to check hardware efuse available or not
 *	2. Read Efuse/EEPROM
 *	3. Read file if necessary
 *	4. Parsing Efuse data
 */
u8 rtl8730a_read_efuse(PADAPTER adapter)
{
	PHAL_DATA_TYPE hal;
	u8 val8;
	u8 *efuse_map = NULL;
	u8 valid;
	u8 ret = _FAIL;

	hal = GET_HAL_DATA(adapter);
	efuse_map = hal->efuse_eeprom_data;

	/* 1. Read registers to check hardware eFuse available or not */
	/*val8 = rtw_read8(adapter, REG_SYS_EEPROM_CTRL_8730A);*/
	/*hal->EepromOrEfuse = (val8 & BIT_EERPOMSEL_8730A) ? _TRUE : _FALSE;*/
	/*to read from efuse*/
	hal->EepromOrEfuse = _FALSE;
	/*hal->bautoload_fail_flag = (val8 & BIT_AUTOLOAD_SUS_8730A) ? _FALSE : _TRUE;*/
	/*
	 * In 8730A, bautoload_fail_flag is used to present eFuse map is valid
	 * or not, no matter the map comes from hardware or files.
	 */

	/* 2. Read eFuse */
	EFUSE_ShadowMapUpdate(adapter, EFUSE_WIFI, 0);

	/* 3. Read Efuse file if necessary */
#ifdef CONFIG_EFUSE_CONFIG_FILE
	if (check_phy_efuse_tx_power_info_valid(adapter) == _FALSE) {
		if (Hal_readPGDataFromConfigFile(adapter) != _SUCCESS) {
			RTW_WARN("%s: invalid phy efuse and read from file fail, will use driver default!!\n", __FUNCTION__);
		}
	}
#endif /* CONFIG_EFUSE_CONFIG_FILE */

	/* 4. Parse Efuse data */
	valid = Hal_EfuseParseIDCode(adapter, efuse_map);
	if (_TRUE == valid) {
		hal->bautoload_fail_flag = _FALSE;
	} else {
		hal->bautoload_fail_flag = _TRUE;
	}

	Hal_EfuseParseEEPROMVer(adapter, efuse_map, valid);
	hal_config_macaddr(adapter, hal->bautoload_fail_flag);
	if (Hal_EfuseParseTxPowerInfo(adapter, efuse_map, valid) != _SUCCESS) {
		goto exit;
	}
	Hal_EfuseParseBoardType(adapter, efuse_map, valid);
	Hal_EfuseParseBTCoexistInfo(adapter, efuse_map, valid);
	Hal_EfuseParseChnlPlan(adapter, efuse_map, hal->bautoload_fail_flag);
	Hal_EfuseParseXtal(adapter, efuse_map, valid);
	Hal_EfuseParseThermalMeter(adapter, efuse_map, valid);
	Hal_EfuseParsePathSelection(adapter, efuse_map, valid);
	Hal_EfuseParseAntennaDiversity(adapter, efuse_map, valid);
	Hal_EfuseParseCustomerID(adapter, efuse_map, valid);
	Hal_DetectWoWMode(adapter);
	if (Hal_ReadRFEType(adapter, efuse_map, valid) != _SUCCESS) {
		goto exit;
	}

	/* Data out of Efuse Map */
	/*l_EfuseParsePackageType(adapter, efuse_map, valid);*/

#ifdef CONFIG_USB_HCI
	Hal_ReadUsbModeSwitch(adapter, efuse_map, valid);
	hal_read_usb_pid_vid(adapter, efuse_map, valid);
#endif /* CONFIG_USB_HCI */

	/* set coex. ant info once efuse parsing is done */
#ifdef CONFIG_BT_COEXIST
	rtw_btcoex_set_ant_info(adapter);
#else
	rtw_btcoex_wifionly_AntInfoSetting(adapter);
#endif

#if 0
	if (hal_read_mac_hidden_rpt(adapter))
		;

	{
		struct hal_spec_t *hal_spec = GET_HAL_SPEC(adapter);

		if (hal_spec->hci_type <= 3 && hal_spec->hci_type >= 1) {
			hal->EEPROMBluetoothCoexist = _FALSE;
			RTW_INFO("EEPROM Disable BT-coex by hal_spec\n");
			rtw_btcoex_wifionly_AntInfoSetting(adapter);
		}
	}
#endif

	rtw_phydm_read_efuse(adapter);

	ret = _SUCCESS;

exit:
	return ret;
}

void rtl8730a_run_thread(PADAPTER adapter)
{
}

void rtl8730a_cancel_thread(PADAPTER adapter)
{
}

/*
 * Description:
 *	Using 0x100 to check the power status of FW.
 */
static u8 check_ips_status(PADAPTER adapter)
{
	u8 val8;


	RTW_INFO(FUNC_ADPT_FMT ": Read 0x100=0x%02x 0x86=0x%02x\n",
		 FUNC_ADPT_ARG(adapter),
		 rtw_read8(adapter, 0x100), rtw_read8(adapter, 0x86));

	val8 = rtw_read8(adapter, 0x100);
	if (val8 == 0xEA) {
		return _TRUE;
	}

	return _FALSE;
}

static void InitBeaconParameters(PADAPTER adapter)
{
	/* make sure caller acquire rtw_lock_multiport_sel() */
	PHAL_DATA_TYPE hal = GET_HAL_DATA(adapter);
	u8 val8 = 0;
	u32 val32 = 0;

	val8 |= BIT_P0_DIS_TSF_UDT_8730A;
#ifdef CONFIG_BT_COEXIST
	if (hal->EEPROMBluetoothCoexist)
		/* Enable port0 beacon function for PSTDMA under BTCOEX */
	{
		val8 |= BIT_P0_EN_BCN_FUNCTION;
	}
#endif
	rtw_write8(adapter, REG_BCN_CTRL_PORT0_8730A, val8);

	/* TBTT setup time */
	val32 = rtw_read32(adapter, REG_TBTT_PROHIBIT_8730A);
	val32 &= ~((u32)BIT_MASK_TBTT_PROHIBIT_SETUP_8730A << BIT_SHIFT_TBTT_PROHIBIT_SETUP_8730A);
	val32 &= ~((u32)BIT_MASK_TBTT_HOLD_TIME_8730A << BIT_SHIFT_TBTT_HOLD_TIME_8730A);
	val32 |= BIT_TBTT_PROHIBIT_SETUP_8730A(TBTT_PROHIBIT_SETUP_TIME);
	val32 |= BIT_TBTT_HOLD_TIME_8730A(TBTT_PROHIBIT_HOLD_TIME_STOP_BCN);

	/* TBTT hold time: 0x1504[19:8] */
	rtw_write32(adapter, REG_TBTT_PROHIBIT_8730A, val32);

	val32 = (0 | BIT_DRVERLYITV_P0_8730A(DRIVER_EARLY_INT_TIME_8730A) | /* 5ms */ \
		 BIT_BCNDMATIM_P0_8730A(BCN_DMA_ATIME_INT_TIME_8730A)); /* 2ms */
	rtw_write32(adapter, REG_PORT0_BCN_ERLY_DMA_CTRL_8730A, val32); /* 5ms */

