StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_ops.c
	/* misc */
	mon->known_misc0 = 1;
	mon->misc0 = rtw_read32(adapter, 0x8c0);
	tmp_32bit = (mon->misc0 & 0xFFF0000F);
	tmp_32bit |= 0x4020;
	rtw_write32(adapter, 0x8c0, tmp_32bit);
#endif /* CONFIG_WIFI_MONITOR */
}

static void set_opmode_port0(PADAPTER adapter, u8 mode)
{
	u8 is_tx_bcn;
	u8 val8;
	u16 val16;
	u32 val32;
	u32 add_msr[4] = {0};
	u32 rm_msr[4] = {0};

#ifdef CONFIG_CONCURRENT_MODE
	is_tx_bcn = rtw_mi_get_ap_num(adapter) || rtw_mi_get_mesh_num(adapter);
#else /* !CONFIG_CONCURRENT_MODE */
	is_tx_bcn = 0;
#endif /* !CONFIG_CONCURRENT_MODE */

	/* disable Port0 TSF update */
	rtw_iface_disable_tsf_update(adapter);

	Set_MSR(adapter, mode);

	RTW_INFO(FUNC_ADPT_FMT ": hw_port(%d) mode=%d\n",
		 FUNC_ADPT_ARG(adapter), adapter->hw_port, mode);

	switch (mode) {
	case _HW_STATE_NOLINK_:
	case _HW_STATE_STATION_:
		if (!is_tx_bcn) {
			StopTxBeacon(adapter);
#if defined(CONFIG_AXI_HCI) && !defined(CONFIG_AXI_BCN_POLLING)
			rm_msr[0] = (BIT_TXBCN1_ERR_INT_EN | BIT_TXBCN1_OK_INT_EN);
			rm_msr[2] = BIT_BCNERLY0_INT;
			rtl8730aa_update_interrupt_mask(adapter, add_msr, rm_msr);
#endif /* CONFIG_AXI_HCI */
		}

		rtw_enter_protsel_port(adapter, adapter->hw_port);
		/* disable beacon function */
		val8 = BIT_P0_DIS_TSF_UDT_8730A | BIT_P0_EN_BCN_FUNCTION_8730A;
		rtw_write8(adapter, REG_BCN_CTRL_PORT0_8730A, val8);
		rtw_leave_protsel_port(adapter);

		/* disable atim wnd(only for Port0) */
		rtw_enter_protsel_port(adapter, adapter->hw_port);
		val8 = rtw_read8(adapter, REG_DIS_ATIM_8730A);
		val8 |= BIT_DIS_ATIM_ROOT_8730A;
		rtw_write8(adapter, REG_DIS_ATIM_8730A, val8);
		rtw_leave_protsel_port(adapter);
		break;

	case _HW_STATE_ADHOC_:
		ResumeTxBeacon(adapter);
		rtw_enter_protsel_port(adapter, adapter->hw_port);
		val8 = BIT_P0_DIS_TSF_UDT_8730A | BIT_P0_EN_BCN_FUNCTION_8730A;
		rtw_write8(adapter, REG_BCN_CTRL_PORT0_8730A, val8);
		rtw_leave_protsel_port(adapter);
		break;

	case _HW_STATE_AP_:
		/* set REG_CR bit 8 */
		val8 = rtw_read8(adapter, REG_CR + 1);
		val8 |= BIT(0); // ENSWBCN
		rtw_write8(adapter,  REG_CR + 1, val8);

		/* Software beacon should set this bit */
		val32 = rtw_read32(adapter, REG_AXI_CTRL);
		val32 |= BIT_MBSSID_ENSWBCN_BACKDOOR;
		rtw_write32(adapter, REG_AXI_CTRL, val32);

#if defined(CONFIG_AXI_HCI) && !defined(CONFIG_AXI_BCN_POLLING)
		add_msr[0] = (BIT_TXBCN1_ERR_INT_EN | BIT_TXBCN1_OK_INT_EN);
		add_msr[2] = BIT_BCNERLY0_INT;
		rtl8730aa_update_interrupt_mask(adapter, add_msr, rm_msr);
#endif /* CONFIG_AXI_HCI */
		/*
		 * enable BCN0 Function for if1
		 * disable update TSF0 for if1
		 * enable TX BCN report:
		 * Reg REG_FWHW_TXQ_HWSSN_CTRL_8730A [2] = 1
		 * Reg REG_BCN_CTRL_8733B[3][5] = 1
		 * Enable ATIM
		 * Enable HW seq for BCN
		 */
		/* enable TX BCN report */
		/* disable RX BCN report */
		rtw_enter_protsel_port(adapter, adapter->hw_port);
		val8 = rtw_read8(adapter, REG_FWHW_TXQ_HWSSN_CTRL_8730A);
		val8 |= BIT_EN_BCN_TXRPT_8730A;
		rtw_write8(adapter, REG_FWHW_TXQ_HWSSN_CTRL_8730A, val8);
		rtw_leave_protsel_port(adapter);

		rtw_enter_protsel_port(adapter, adapter->hw_port);
		/* enable BCN0 Function */
		val8 = rtw_read8(adapter, REG_BCN_CTRL_PORT0_8730A);
		val8 |= BIT_P0_EN_BCN_FUNCTION_8730A | BIT_P0_DIS_TSF_UDT_8730A\
			| BIT_P0_TXBCN_RPT_ENABLE_8730A | BIT_P0_EN_BCN_RPT_8730A;
		val8 &= (~BIT_P0_RXBCN_RPT_ENABLE_8730A);
		rtw_write8(adapter, REG_BCN_CTRL_PORT0_8730A, val8);
		rtw_leave_protsel_port(adapter);

		/* Enable ATIM */
		val8 = rtw_read8(adapter, REG_DIS_ATIM_8730A);
		val8 &= ~BIT_DIS_ATIM_ROOT_8730A;
		rtw_write8(adapter, REG_DIS_ATIM_8730A, val8);

		/* Enable HW seq for BCN
			0x423[0]: EN_HWSEQ
			0x423[1]: EN_HWSEQEXT
			According TX desc
		*/
		rtw_write8(adapter, REG_FWHW_TXQ_HWSSN_CTRL + 3, 0x01);

		/* enable to rx data frame */
		rtw_write16(adapter, REG_RXFLTMAP_8730A, 0xFFFF);
		/* enable to rx ps-poll */
		val16 = rtw_read16(adapter, REG_RXFLTMAP1_8730A);
		val16 |= BIT_CTRLFLT10EN_8730A;
		rtw_write16(adapter, REG_RXFLTMAP1_8730A, val16);

		/* Beacon Control related register for first time */
		rtw_write8(adapter, REG_PORT0_BCN_ERLY_DMA_CTRL_8730A + 1, 0x02); /* 2ms */

		rtw_write8(adapter, REG_ATIMWND0_8730A, 0x0c); /* 12ms */

		rtw_write16(adapter, REG_TSFT_SYN_OFFSET_SLOT_8730A, 0x7fff); /* +32767 (~32ms) */

		rtw_enter_protsel_port(adapter, adapter->hw_port);
		/* SW_BCN_SEL - Port0 */
		rtw_hal_set_hwreg(adapter, HW_VAR_DL_BCN_SEL, NULL);

		/* select BCN on port 0 */
		val8 = rtw_read8(adapter, REG_BCN_AMPDU_CTCL_8730A);
		val8 &= ~BIT_BCN_PORT_SEL_8730A;
		rtw_write8(adapter, REG_BCN_AMPDU_CTCL_8730A, val8);
		rtw_leave_protsel_port(adapter);
		break;
	}
}

static void set_opmode_port1(PADAPTER adapter, u8 mode)
{
#ifdef CONFIG_CONCURRENT_MODE
	u8 is_tx_bcn;
	u8 val8;

	is_tx_bcn = rtw_mi_get_ap_num(adapter) || rtw_mi_get_mesh_num(adapter);

	/* disable Port1 TSF update */
	rtw_iface_disable_tsf_update(adapter);

	Set_MSR(adapter, mode);

	RTW_INFO(FUNC_ADPT_FMT ": hw_port(%d) mode=%d\n",
		 FUNC_ADPT_ARG(adapter), adapter->hw_port, mode);

	switch (mode) {
	case _HW_STATE_NOLINK_:
	case _HW_STATE_STATION_:
		if (!is_tx_bcn) {
			StopTxBeacon(adapter);
		}

		/* disable beacon function */
		rtw_enter_protsel_port(adapter, adapter->hw_port);
		val8 = BIT_P1_DIS_TSF_UDT_8730A | BIT_P1_EN_BCN_FUNCTION_8730A;
		rtw_write8(adapter, REG_BCN_CTRL_PORT1_8730A, val8);
		rtw_leave_protsel_port(adapter);
		break;

	case _HW_STATE_ADHOC_:
		ResumeTxBeacon(adapter);
		rtw_enter_protsel_port(adapter, adapter->hw_port);
		val8 = BIT_P1_DIS_TSF_UDT_8730A | BIT_P1_EN_BCN_FUNCTION_8730A;
		rtw_write8(adapter, REG_BCN_CTRL_PORT1_8730A, val8);
		rtw_leave_protsel_port(adapter);
		break;

	case _HW_STATE_AP_:
		break;
	}
#endif /* CONFIG_CONCURRENT_MODE */
}

void hw_tsf_reset(_adapter *adapter)
{
	u8 hw_port = rtw_hal_get_port(adapter);
	u8 val8;

	if (hw_port >= MAX_HW_PORT) {
		RTW_ERR(FUNC_ADPT_FMT" HW Port(%d) invalid\n", FUNC_ADPT_ARG(adapter), hw_port);
		rtw_warn_on(1);
		return;
	}

	rtw_enter_protsel_port(adapter, hw_port);
	val8 = rtw_read8(adapter, REG_DUAL_TSF_RST_8730A);
	if (hw_port == HW_PORT0) {
		val8 |= BIT_TSFTR_RST_8730A;
	} else {
		val8 |= BIT_TSFTR1_RST_8730A;
	}
	rtw_write8(adapter, REG_DUAL_TSF_RST_8730A, val8);
	rtw_leave_protsel_port(adapter);
}
void hw_set_ta(_adapter *adapter, u8 hw_port, u8 *val)
{
	u8 idx = 0;
	u32 reg = port_cfg[hw_port].ta;

