StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_ops.c
	for (idx = 0 ; idx < ETH_ALEN; idx++) {
		rtw_write8(adapter, (reg + idx), val[idx]);
	}

	RTW_INFO("%s("ADPT_FMT") hw port -%d TA: "MAC_FMT"\n",
		 __func__, ADPT_ARG(adapter), hw_port, MAC_ARG(val));
}
void hw_set_aid(_adapter *adapter, u8 hw_port, u8 aid)
{
	rtw_write16(adapter, port_cfg[hw_port].ps_aid, (0xF800 | aid));
	RTW_INFO("%s("ADPT_FMT") hw port -%d AID: %d\n",
		 __func__, ADPT_ARG(adapter), hw_port, aid);
}
#ifdef CONFIG_CLIENT_PORT_CFG
void rtw_hw_client_port_cfg(_adapter *adapter)
{
	struct mlme_ext_priv	*pmlmeext = &adapter->mlmeextpriv;
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);
	u8 clt_port = get_clt_port(adapter);

	if (clt_port == CLT_PORT_INVALID) {
		return;
	}
	RTW_INFO("%s ("ADPT_FMT")\n", __func__, ADPT_ARG(adapter));

	/*Network type*/
	rtw_halmac_set_network_type(adapter_to_dvobj(adapter), clt_port, _HW_STATE_STATION_);
	/*A1*/
	rtw_halmac_set_mac_address(adapter_to_dvobj(adapter), clt_port, adapter_mac_addr(adapter));
	/*A2*/
	hw_set_ta(adapter, clt_port, pmlmeinfo->network.MacAddress);
	/*A3*/
	rtw_halmac_set_bssid(adapter_to_dvobj(adapter), clt_port, pmlmeinfo->network.MacAddress);
	/*Beacon space*/
	rtw_halmac_set_bcn_interval(adapter_to_dvobj(adapter), clt_port, pmlmeinfo->bcn_interval);
	/*AID*/
	hw_set_aid(adapter, clt_port, pmlmeinfo->aid);
	/*Beacon control*/
	hw_bcn_ctrl_set(adapter, clt_port, (BIT_P0_RXBCN_RPT_ENABLE | BIT_P0_EN_BCN_FUNCTION));

	RTW_INFO("%s ("ADPT_FMT") clt_port:%d\n", __func__, ADPT_ARG(adapter), clt_port);
}

/*#define DBG_TSF_MONITOR*/
void rtw_hw_client_port_clr(_adapter *adapter)
{
	u8 null_addr[ETH_ALEN] = {0};
	u8 clt_port = get_clt_port(adapter);

	if (clt_port == CLT_PORT_INVALID) {
		return;
	}
	RTW_INFO("%s ("ADPT_FMT") ==> \n", __func__, ADPT_ARG(adapter));

#ifdef DBG_TSF_MONITOR
	/*Beacon control*/
	hw_bcn_ctrl_clr(adapter, clt_port, BIT_P0_EN_BCN_FUNCTION);
	hw_tsf_reset(adapter);
#endif

	/*Network type*/
	rtw_halmac_set_network_type(adapter_to_dvobj(adapter), clt_port, _HW_STATE_NOLINK_);
	/*A1*/
	rtw_halmac_set_mac_address(adapter_to_dvobj(adapter), clt_port, null_addr);
	/*A2*/
	hw_set_ta(adapter, clt_port, null_addr);
	/*A3*/
	rtw_halmac_set_bssid(adapter_to_dvobj(adapter), clt_port, null_addr);

#ifdef DBG_TSF_MONITOR
	if (0)
#endif
		/*Beacon control*/
		hw_bcn_ctrl_set(adapter, clt_port, (BIT_P0_DIS_TSF_UDT | BIT_P0_EN_BCN_FUNCTION));

	/*AID*/
	hw_set_aid(adapter, clt_port, 0);
	RTW_INFO("%s("ADPT_FMT") clt_port:%d\n", __func__, ADPT_ARG(adapter), clt_port);
}
#endif

static void hw_var_set_opmode(PADAPTER adapter, u8 mode)
{
	static u8 isMonitor = _FALSE;

	if (isMonitor == _TRUE) {
#ifdef CONFIG_WIFI_MONITOR
		struct mon_reg_backup *backup = &GET_HAL_DATA(adapter)->mon_backup;

		if (backup->known_rcr) {
			backup->known_rcr = 0;
			rtw_hal_set_hwreg(adapter, HW_VAR_RCR, (u8 *)&backup->rcr);

			if (!!(backup->rcr &= BIT_APP_PHYSTS_8730A))
				rtw_halmac_config_rx_info(adapter_to_dvobj(adapter),
							  HALMAC_DRV_INFO_PHY_STATUS);
			else
				rtw_halmac_config_rx_info(adapter_to_dvobj(adapter),
							  HALMAC_DRV_INFO_NONE);

			rtw_hal_rcr_set_chk_bssid(adapter, MLME_ACTION_NONE);
		}
		if (backup->known_rxfilter) {
			backup->known_rxfilter = 0;
			rtw_write16(adapter, REG_RXFLTMAP0_8730A, backup->rxfilter0);
			rtw_write16(adapter, REG_RXFLTMAP1_8730A, backup->rxfilter1);
			rtw_write16(adapter, REG_RXFLTMAP_8730A, backup->rxfilter2);
		}
#endif /* CONFIG_WIFI_MONITOR */
		isMonitor = _FALSE;
	}

	if (mode == _HW_STATE_MONITOR_) {
		isMonitor = _TRUE;

		Set_MSR(adapter, _HW_STATE_NOLINK_);
		set_opmode_monitor(adapter);
		return;
	}

	/* clear crc bit */
	if (rtw_hal_rcr_check(adapter, BIT_ACRC32_8730A)) {
		rtw_hal_rcr_clear(adapter, BIT_ACRC32_8730A);
	}

#ifdef CONFIG_MI_WITH_MBSSID_CAM /*For Port0 - MBSS CAM*/
	if (adapter->hw_port != HW_PORT0) {
		RTW_ERR(ADPT_FMT ": Configure MBSSID cam on HW_PORT%d\n", ADPT_ARG(adapter), adapter->hw_port);
		rtw_warn_on(1);
	} else {
		hw_var_set_opmode_mbid(adapter, mode);
	}
#else

	switch (adapter->hw_port) {
	case HW_PORT0:
		set_opmode_port0(adapter, mode);
		break;

	case HW_PORT1:
		set_opmode_port1(adapter, mode);
		break;

	default:
		break;
	}
#endif
}

static void hw_var_hw_port_cfg(_adapter *adapter, u8 enable)
{
	if (enable) {
		hw_bcn_ctrl_add(adapter, get_hw_port(adapter), (BIT_P0_RXBCN_RPT_ENABLE_8730A | BIT_P0_DIS_TSF_UDT_8730A | BIT_P0_EN_BCN_FUNCTION_8730A));
	} else {
		hw_bcn_ctrl_clr(adapter, get_hw_port(adapter), BIT_P0_EN_BCN_FUNCTION_8730A);
	}
}

static void hw_var_set_bcn_func(PADAPTER adapter, u8 enable)
{
	u8 val8 = 0;

	if (enable) {
		/* enable TX BCN report
		 *  Reg REG_FWHW_TXQ_HWSSN_CTRL_8730A[2] = 1
		 *  Reg REG_BCN_CTRL_8730A[3][5] = 1
		 */
		val8 = rtw_read8(adapter, REG_FWHW_TXQ_HWSSN_CTRL_8730A);
		val8 |= BIT_EN_BCN_TXRPT_8730A;
		rtw_write8(adapter, REG_FWHW_TXQ_HWSSN_CTRL_8730A, val8);

		switch (adapter->hw_port) {
		case HW_PORT0:
			val8 =  BIT_P0_EN_BCN_FUNCTION_8730A | BIT_P0_EN_BCN_RPT_8730A;
			hw_bcn_ctrl_clr(adapter, get_hw_port(adapter), BIT_P0_RXBCN_RPT_ENABLE_8730A);
			break;
#ifdef CONFIG_CONCURRENT_MODE
		case HW_PORT1:
			val8 =  BIT_P1_EN_BCN_FUNCTION_8730A;
			hw_bcn_ctrl_clr(adapter, get_hw_port(adapter), BIT_P1_RXBCN_RPT_ENABLE_8730A);
			break;
#endif /* CONFIG_CONCURRENT_MODE */
		default:
			RTW_ERR(FUNC_ADPT_FMT" Unknow hw port(%d) \n", FUNC_ADPT_ARG(adapter), adapter->hw_port);
			rtw_warn_on(1);
			break;

		}
		hw_bcn_ctrl_add(adapter, get_hw_port(adapter), val8);
	} else {

		switch (adapter->hw_port) {
		case HW_PORT0:
			val8 =  BIT_P0_EN_BCN_FUNCTION_8730A | BIT_P0_EN_BCN_RPT_8730A;
#ifdef CONFIG_BT_COEXIST
			/* Always enable port0 beacon function for PSTDMA */
			if (GET_HAL_DATA(adapter)->EEPROMBluetoothCoexist) {
				val8 = BIT_P0_EN_BCN_RPT_8730A;
			}
#endif /* CONFIG_BT_COEXIST */
			break;
#ifdef CONFIG_CONCURRENT_MODE
		case HW_PORT1:
			val8 =  BIT_P1_EN_BCN_FUNCTION_8730A;
			break;
#endif /* CONFIG_CONCURRENT_MODE */
		default:
			RTW_ERR(FUNC_ADPT_FMT" Unknow hw port(%d) \n", FUNC_ADPT_ARG(adapter), adapter->hw_port);
			rtw_warn_on(1);
			break;
		}

		hw_bcn_ctrl_clr(adapter, get_hw_port(adapter), val8);
	}
}

static void hw_var_set_mlme_disconnect(PADAPTER adapter)
{
	u8 val8;
	struct mi_state mstate;

#ifdef CONFIG_CONCURRENT_MODE
	if (rtw_mi_check_status(adapter, MI_LINKED) == _FALSE)
#endif
		/* reject all data frames under not link state */
		rtw_write16(adapter, REG_RXFLTMAP_8730A, 0);

	if (adapter->hw_port < MAX_HW_PORT) {
		/* reset TSF1(CLINT0) */
		rtw_enter_protsel_port(adapter, adapter->hw_port);
		val8 = rtw_read8(adapter, REG_DUAL_TSF_RST_8730A);
		val8 |= BIT_TSFTR_RST_8730A;
		rtw_write8(adapter, REG_DUAL_TSF_RST_8730A, val8);
		rtw_leave_protsel_port(adapter);

		/* disable update TSF1(CLINT0) */
		rtw_iface_disable_tsf_update(adapter);

		switch (adapter->hw_port) {
		case HW_PORT0:
			/* disable Port1's beacon function */
			rtw_enter_protsel_port(adapter, adapter->hw_port);
			val8 = rtw_read8(adapter, REG_BCN_CTRL_PORT0_8730A);
			val8 &= ~BIT_P0_EN_BCN_FUNCTION_8730A;
			rtw_write8(adapter, REG_BCN_CTRL_PORT0_8730A, val8);
			rtw_leave_protsel_port(adapter);
			break;
		case HW_PORT1:
			/* disable Port1's beacon function */
			rtw_enter_protsel_port(adapter, adapter->hw_port);
			val8 = rtw_read8(adapter, REG_BCN_CTRL_PORT1_8730A);
			val8 &= ~BIT_P1_EN_BCN_FUNCTION_8730A;
			rtw_write8(adapter, REG_BCN_CTRL_PORT1_8730A, val8);
			rtw_leave_protsel_port(adapter);
			break;
		default:
			RTW_ERR(FUNC_ADPT_FMT" Unknow hw port(%d) \n", FUNC_ADPT_ARG(adapter), adapter->hw_port);
			rtw_warn_on(1);
			break;
		}
	}

