StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_ops.c
	rtw_mi_status_no_self(adapter, &mstate);

	/* clear update TSF only BSSID match for no linked station */
	if (MSTATE_STA_LD_NUM(&mstate) == 0 && MSTATE_STA_LG_NUM(&mstate) == 0) {
		rtl8730a_rx_tsf_addr_filter_config(adapter, 0);
	}

#ifdef CONFIG_CLIENT_PORT_CFG
	if (MLME_IS_STA(adapter)) {
		rtw_hw_client_port_clr(adapter);
	}
#endif

}

static void hw_var_set_mlme_sitesurvey(PADAPTER adapter, u8 enable)
{
	struct dvobj_priv *dvobj;
	PHAL_DATA_TYPE hal;
	struct mlme_priv *pmlmepriv;
	PADAPTER iface;
	u32 reg_bcn_ctl;
	u16 value_rxfltmap2;
	u8 val8, i;


	dvobj = adapter_to_dvobj(adapter);
	hal = GET_HAL_DATA(adapter);
	pmlmepriv = &adapter->mlmepriv;

#ifdef CONFIG_FIND_BEST_CHANNEL
	/* Receive all data frames */
	value_rxfltmap2 = 0xFFFF;
#else
	/* not to receive data frame */
	value_rxfltmap2 = 0;
#endif

	if (enable) {
		/*
		 * 1. configure REG_RXFLTMAP2
		 * 2. config RCR to receive different BSSID BCN or probe rsp
		 */

		rtw_write16(adapter, REG_RXFLTMAP_8730A, value_rxfltmap2);

		rtw_hal_rcr_set_chk_bssid(adapter, MLME_SCAN_ENTER);

		if (rtw_mi_get_ap_num(adapter) || rtw_mi_get_mesh_num(adapter)) {
			StopTxBeacon(adapter);
		}
	} else {
		/* sitesurvey done
		 * 1. enable rx data frame
		 * 2. config RCR not to receive different BSSID BCN or probe rsp
		 */

		if (rtw_mi_check_fwstate(adapter, WIFI_ASOC_STATE | WIFI_AP_STATE | WIFI_MESH_STATE))
			/* enable to rx data frame */
		{
			rtw_write16(adapter, REG_RXFLTMAP_8730A, 0xFFFF);
		}

		rtw_hal_rcr_set_chk_bssid(adapter, MLME_SCAN_DONE);

#ifdef CONFIG_AP_MODE
		if (rtw_mi_get_ap_num(adapter) || rtw_mi_get_mesh_num(adapter)) {
			ResumeTxBeacon(adapter);
			rtw_mi_tx_beacon_hdl(adapter);
		}
#endif
	}
}

static void hw_var_set_mlme_join(PADAPTER adapter, u8 type)
{
	struct mlme_ext_priv	*pmlmeext = &adapter->mlmeextpriv;
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);
	u8 val8;
	u16 val16;
	u32 val32;
	u8 RetryLimit;
	PHAL_DATA_TYPE hal;
	struct mlme_priv *pmlmepriv;
	int i;

	RetryLimit = RL_VAL_STA;
	hal = GET_HAL_DATA(adapter);
	pmlmepriv = &adapter->mlmepriv;


#ifdef CONFIG_CONCURRENT_MODE
	if (type == 0) {
		/* prepare to join */
		if (rtw_mi_get_ap_num(adapter) || rtw_mi_get_mesh_num(adapter)) {
			StopTxBeacon(adapter);
		}

		/* enable to rx data frame.Accept all data frame */
		rtw_write16(adapter, REG_RXFLTMAP_8730A, 0xFFFF);

		if (check_fwstate(pmlmepriv, WIFI_STATION_STATE) == _TRUE) {
			RetryLimit = (hal->CustomerID == RT_CID_CCX) ? RL_VAL_AP : RL_VAL_STA;
		} else { /* Ad-hoc Mode */
			RetryLimit = RL_VAL_AP;
		}

		/*
		 * for 8730A, must enable BCN function if BIT_CBSSID_BCN_8730A(bit 7) of REG_RCR(0x608) is enable to recv BSSID bcn
		 */
		hw_var_set_bcn_func(adapter, _TRUE);

		/* update TSF only BSSID match for station mode */
		rtl8730a_rx_tsf_addr_filter_config(adapter, BIT_NAN_RX_FILTER_EN_8730A | BIT_NAN_RX_CHKBSSID_8730A);
#ifdef CONFIG_CLIENT_PORT_CFG
		rtw_hw_client_port_cfg(adapter);
#endif

		rtw_iface_enable_tsf_update(adapter);

	} else if (type == 1) {
		/* joinbss_event call back when join res < 0 */
		if (rtw_mi_check_status(adapter, MI_LINKED) == _FALSE) {
			rtw_write16(adapter, REG_RXFLTMAP_8730A, 0x00);
		}

		rtw_iface_disable_tsf_update(adapter);

		if (rtw_mi_get_ap_num(adapter) || rtw_mi_get_mesh_num(adapter)) {
			ResumeTxBeacon(adapter);
		}
#ifdef CONFIG_CLIENT_PORT_CFG
		if (MLME_IS_STA(adapter)) {
			rtw_hw_client_port_clr(adapter);
		}
#endif

	} else if (type == 2) {
		/* sta add event callback */
		if (check_fwstate(pmlmepriv, WIFI_ADHOC_STATE | WIFI_ADHOC_MASTER_STATE)) {
			rtw_write8(adapter, 0x542, 0x02);
			RetryLimit = RL_VAL_AP;
		}

		if (rtw_mi_get_ap_num(adapter) || rtw_mi_get_mesh_num(adapter)) {
			ResumeTxBeacon(adapter);
		}
	}

	val16 = (u16)((u16)RetryLimit | (u16)RetryLimit << 8);
	rtw_write16(adapter, REG_RETRY_LIMIT_SIFS_8730A + 2, val16);
#else /* !CONFIG_CONCURRENT_MODE */
	if (type == 0) {
		/* prepare to join */

		/* enable to rx data frame. Accept all data frame */
		rtw_write16(adapter, REG_RXFLTMAP_8730A, 0xFFFF);

		/*
		 * for 8730A, must enable BCN function if BIT_CBSSID_BCN_8730A(bit 7) of REG_RCR(0x608) is enabled to recv BSSID bcn
		 */
		hw_var_set_bcn_func(adapter, _TRUE);

		/* update TSF only BSSID match for station mode */
		rtl8730a_rx_tsf_addr_filter_config(adapter, BIT_NAN_RX_FILTER_EN_8730A | BIT_NAN_RX_CHKBSSID_8730A);

		if (check_fwstate(pmlmepriv, WIFI_STATION_STATE) == _TRUE) {
			RetryLimit = (hal->CustomerID == RT_CID_CCX) ? RL_VAL_AP : RL_VAL_STA;
		} else { /* Ad-hoc Mode */
			RetryLimit = RL_VAL_AP;
		}

		rtw_iface_enable_tsf_update(adapter);

	} else if (type == 1) {
		/* joinbss_event call back when join res < 0 */
		rtw_write16(adapter, REG_RXFLTMAP_8730A, 0x00);

		rtw_iface_disable_tsf_update(adapter);

	} else if (type == 2) {
		/* sta add event callback */
		if (check_fwstate(pmlmepriv, WIFI_ADHOC_STATE | WIFI_ADHOC_MASTER_STATE)) {
			RetryLimit = RL_VAL_AP;
		}
	}

	val16 = (u16)((u16)RetryLimit | (u16)RetryLimit << 8);
	rtw_write16(adapter, REG_RETRY_LIMIT_SIFS_8730A + 2, val16);
#endif /* !CONFIG_CONCURRENT_MODE */
}

static void hw_var_set_acm_ctrl(PADAPTER adapter, u8 ctrl)
{
	u8 hwctrl = 0;

	if (ctrl) {
		hwctrl |= BIT_ACMHWEN_8730A;

		if (ctrl & BIT(1)) { /* BE */
			hwctrl |= BIT_BEQ_ACM_EN_8730A;
		} else {
			hwctrl &= (~BIT_BEQ_ACM_EN_8730A);
		}

		if (ctrl & BIT(2)) { /* VI */
			hwctrl |= BIT_VIQ_ACM_EN_8730A;
		} else {
			hwctrl &= (~BIT_VIQ_ACM_EN_8730A);
		}

		if (ctrl & BIT(3)) { /* VO */
			hwctrl |= BIT_VOQ_ACM_EN_8730A;
		} else {
			hwctrl &= (~BIT_VOQ_ACM_EN_8730A);
		}
	}

	RTW_INFO("[HW_VAR_ACM_CTRL] Write 0x%02X\n", hwctrl);
	rtw_write8(adapter, REG_ACMHWCTRL_8730A, hwctrl);
}

void hw_var_lps_rfon_chk(_adapter *adapter, u8 rfon_ctrl)
{
#ifdef CONFIG_LPS_ACK
	struct pwrctrl_priv 	*pwrpriv = adapter_to_pwrctl(adapter);

	if (rfon_ctrl == rf_on) {
		if (rtw_sctx_wait(&pwrpriv->lps_ack_sctx, __func__)) {
			if (pwrpriv->lps_ack_status > 0) {
				RTW_INFO(FUNC_ADPT_FMT" RF_ON function is not ready !!!\n", FUNC_ADPT_ARG(adapter));
			}
		} else {
			RTW_WARN("LPS RFON sctx query timeout, operation abort!!\n");
		}
		pwrpriv->lps_ack_status = -1;
	}
#endif
}

static void hw_var_set_sec_dk_cfg(PADAPTER adapter, u8 enable)
{
	struct security_priv *sec = &adapter->securitypriv;
	u8 reg_scr = rtw_read8(adapter, REG_SECCFG_8730A);

	if (enable) {
		/* Enable default key related setting */
		reg_scr |= BIT_TXBCUSEDK_8730A;
		if (sec->dot11AuthAlgrthm != dot11AuthAlgrthm_8021X) {
			reg_scr |= BIT_RXUHUSEDK_8730A | BIT_TXUHUSEDK_8730A;
		}
	} else {
		/* Disable default key related setting */
		reg_scr &= ~(BIT_RXBCUSEDK_8730A | BIT_TXBCUSEDK_8730A | BIT_RXUHUSEDK_8730A | BIT_TXUHUSEDK_8730A);
	}

	rtw_write8(adapter, REG_SECCFG_8730A, reg_scr);

