StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_ops.c
	RTW_INFO("%s: [HW_VAR_SEC_DK_CFG] 0x%x=0x%08x\n", __FUNCTION__,
		 REG_SECCFG_8730A, rtw_read32(adapter, REG_SECCFG_8730A));
}

#ifdef CONFIG_PORT_BASED_TXBCN
static const struct bcn_valid {
	u32 addr;
	u32 bit;
} bcn_valids[] = {
	[HW_PORT0] = {REG_DWBCN0_CTRL, BIT_BCN_VALID},
	[HW_PORT1] = {BIT_BCN_VALID_1, BIT_BCN_VALID_1},
	[HW_PORT2] = {BIT_BCN_VALID_1, BIT_BCN_VALID_1},
};
#endif

static void hw_var_set_bcn_valid(PADAPTER adapter, u8 all)
{
	u8 val8 = 0;
	/* BCN_VALID, BIT16 write 1 to clear */

	val8 = rtw_read32(adapter, REG_DWBCN0_CTRL_8730A + 2);
	val8 = val8 | BIT(0);
	rtw_write32(adapter, REG_DWBCN0_CTRL_8730A + 2, val8);

}

static void hw_var_set_dl_bcn_sel(PADAPTER adapter, u8 force_port0)
{
	u32 val32;

	val32 = rtw_read32(adapter, REG_DWBCN1_CTRL_8730A);

#ifdef CONFIG_PORT_BASED_TXBCN
	if (!force_port0) {
		val32 = BIT_SET_SW_BCN_SEL_8730A(val32, rtw_hal_get_port(adapter));
		val32 |= BIT_SW_BCN_SEL_EN;
	} else
#elif defined(CONFIG_CONCURRENT_MODE)
	if (rtw_hal_get_port(adapter) == HW_PORT1) {
		/* SW_BCN_SEL - Port1 */
		val32 = BIT_SET_SW_BCN_SEL_8730A(val32, 1);
		val32 |= BIT_SW_BCN_SEL_EN;
	} else
#endif
	{
		/* SW_BCN_SEL - Port0 */
		val32 = BIT_SET_SW_BCN_SEL_8730A(val32, 0);
		val32 &= ~BIT_SW_BCN_SEL_EN;
	}

	rtw_write32(adapter, REG_DWBCN1_CTRL_8730A, val32);
}

static void hw_var_set_ack_preamble(PADAPTER adapter, u8 bShortPreamble)
{
	u8 val8 = 0;


	val8 = rtw_read8(adapter, REG_WMAC_TRXPTCL_CTL_8730A + 2);
	val8 |= BIT(4) | BIT(5);

	if (bShortPreamble) {
		val8 |= BIT1;
	} else {
		val8 &= (~BIT1);
	}

	rtw_write8(adapter, REG_WMAC_TRXPTCL_CTL_8730A + 2, val8);
}

void hw_var_set_dl_rsvd_page(PADAPTER adapter, u8 mstatus)
{
	PHAL_DATA_TYPE hal = GET_HAL_DATA(adapter);
	struct mlme_ext_priv *pmlmeext = &adapter->mlmeextpriv;
	struct mlme_ext_info *pmlmeinfo = &pmlmeext->mlmext_info;
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(adapter);
	u8 bcn_valid = _FALSE;
	u8 DLBcnCount = 0;
	u32 poll = 0;
	u8 val8;
	u8 restore[2];
	u8 hw_port = rtw_hal_get_port(adapter);

	RTW_INFO(FUNC_ADPT_FMT ":+ hw_port=%d mstatus(%x)\n",
		 FUNC_ADPT_ARG(adapter), hw_port, mstatus);

	if (mstatus == RT_MEDIA_CONNECT) {
#if 0
		u8 bRecover = _FALSE;
#endif
		u8 v8;

		/* We should set AID, correct TSF, HW seq enable before set JoinBssReport to Fw in 8730A. */
		rtw_write16(adapter, port_cfg[hw_port].ps_aid, (0xF800 | pmlmeinfo->aid));

		/* Enable SW TX beacon */
		v8 = rtw_read8(adapter, REG_CR_8730A + 1);
		restore[0] = v8;
		v8 |= (BIT_ENSWBCN_8730A >> 8);
		rtw_write8(adapter, REG_CR_8730A + 1, v8);

		/*
		 * Disable Hw protection for a time which revserd for Hw sending beacon.
		 * Fix download reserved page packet fail that access collision with the protection time.
		 */
		rtw_enter_protsel_port(adapter, hw_port);
		if (hw_port == HW_PORT0) {
			val8 = rtw_read8(adapter, REG_BCN_CTRL_PORT0_8730A);
			restore[1] = val8;
			val8 &= ~BIT_P0_EN_BCN_FUNCTION_8730A;
			val8 |= BIT_P0_DIS_TSF_UDT_8730A;
			rtw_write8(adapter, REG_BCN_CTRL_PORT0_8730A, val8);
		} else if (hw_port == HW_PORT1) {
			val8 = rtw_read8(adapter, REG_BCN_CTRL_PORT1_8730A);
			restore[1] = val8;
			val8 &= ~BIT_P1_EN_BCN_FUNCTION_8730A;
			val8 |= BIT_P1_DIS_TSF_UDT_8730A;
			rtw_write8(adapter, REG_BCN_CTRL_PORT1_8730A, val8);
		}
		rtw_leave_protsel_port(adapter);

		/* Clear beacon valid check bit. */
		rtw_hal_set_hwreg(adapter, HW_VAR_BCN_VALID, BCN_VALID_ALL);
		rtw_hal_set_hwreg(adapter, HW_VAR_DL_BCN_SEL, BCN_SEL_PORT0);

		DLBcnCount = 0;
		poll = 0;
		do {
			/* download rsvd page. */
			rtw_hal_set_fw_rsvd_page(adapter, _FALSE);
			DLBcnCount++;
			do {
				rtw_yield_os();

				/* get cookie for specific port 0 */
				bcn_valid = BCN_VALID_PORT0;

				/* check rsvd page download OK. */
				rtw_hal_get_hwreg(adapter, HW_VAR_BCN_VALID, (u8 *)&bcn_valid);
				poll++;
			} while (!bcn_valid && (poll % 10) != 0 && !RTW_CANNOT_RUN(adapter));

		} while (!bcn_valid && DLBcnCount <= 100 && !RTW_CANNOT_RUN(adapter));

		if (RTW_CANNOT_RUN(adapter))
			;
		else if (!bcn_valid)
			RTW_INFO(FUNC_ADPT_FMT ": DL RSVD page failed! DLBcnCount:%u, poll:%u\n",
				 FUNC_ADPT_ARG(adapter), DLBcnCount, poll);
		else {
			struct pwrctrl_priv *pwrctl = adapter_to_pwrctl(adapter);

			pwrctl->fw_psmode_iface_id = adapter->iface_id;
			rtw_hal_set_fw_rsvd_page(adapter, _TRUE);
			RTW_INFO(ADPT_FMT ": DL RSVD page success! DLBcnCount:%u, poll:%u\n",
				 ADPT_ARG(adapter), DLBcnCount, poll);
		}

		rtw_enter_protsel_port(adapter, hw_port);
		if (hw_port == HW_PORT0) {
			rtw_write8(adapter, REG_BCN_CTRL_PORT0_8730A, restore[1]);
		} else if (hw_port == HW_PORT1) {
			rtw_write8(adapter, REG_BCN_CTRL_PORT1_8730A, restore[1]);
		}
		rtw_leave_protsel_port(adapter);
		rtw_write8(adapter,  REG_CR_8730A + 1, restore[0]);
#if 0
		/*
		 * To make sure that if there exists an adapter which would like to send beacon.
		 * If exists, the origianl value of 0x422[6] will be 1, we should check this to
		 * prevent from setting 0x422[6] to 0 after download reserved page, or it will cause
		 * the beacon cannot be sent by HW.
		 */
		if (bRecover) {
			RegFwHwTxQCtrl |= BIT(6);
			rtw_write8(adapter, REG_FWHW_TXQ_HWSSN_CTRL_8730A + 2, RegFwHwTxQCtrl);
		}
#endif
#ifndef CONFIG_AXI_HCI
		/* Clear CR[8] or beacon packet will not be send to TxBuf anymore. */
		v8 = rtw_read8(adapter, REG_CR_8730A + 1);
		v8 &= ~BIT(0); /* ~ENSWBCN */
		rtw_write8(adapter, REG_CR_8730A + 1, v8);
#endif /* !CONFIG_AXI_HCI */
	}
}

static void hw_var_set_h2c_fw_joinbssrpt(PADAPTER adapter, u8 mstatus)
{
	if (mstatus == RT_MEDIA_CONNECT) {
		hw_var_set_dl_rsvd_page(adapter, RT_MEDIA_CONNECT);
	}
}

/*
 * Parameters:
 *	adapter
 *	enable		_TRUE: enable; _FALSE: disable
 */
static u8 rx_agg_switch(PADAPTER adapter, u8 enable)
{
	int err;

	err = rtw_halmac_rx_agg_switch(adapter_to_dvobj(adapter), enable);
	if (err) {
		return _FAIL;
	}

	return _SUCCESS;
}


#ifdef CONFIG_AP_PORT_SWAP
/*
 * Parameters:
 *	if_ap		ap interface
 *	if_port0		port0 interface
 */

