StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_ops.c
		if (pwrpriv->bkeepfwalive != _TRUE) {
			/* RX DMA stop */
			val32 = rtw_read32(adapter, REG_RXPKT_NUM_8730A);
			val32 |= BIT_RW_RELEASE_EN;
			rtw_write32(adapter, REG_RXPKT_NUM_8730A, val32);
			do {
				val32 = rtw_read32(adapter, REG_RXPKT_NUM_8730A);
				if (val32 & BIT_RXDMA_IDLE_8730A) {
					break;
				}

				RTW_INFO("[HW_VAR_FIFO_CLEARN_UP] val=%x times:%d\n", val32, trycnt);
				rtw_yield_os();
			} while (--trycnt);
			if (trycnt == 0) {
				RTW_INFO("[HW_VAR_FIFO_CLEARN_UP] Stop RX DMA failed!\n");
			}
#if 0
			/* RQPN Load 0 */
			rtw_write16(adapter, REG_RQPN_NPQ, 0);	/* not use */
			rtw_write32(adapter, REG_RQPN, 0x80000000); /*not use*/
			rtw_mdelay_os(2);
#endif
		}
	}
	break;

	case HW_VAR_RESTORE_HW_SEQ: {
		/* restore Sequence No. */
		u32 reg_hw_ssn;

		if (adapter->xmitpriv.hw_ssn_seq_no == 1) {
			reg_hw_ssn = REG_HW_SEQ0_1_8730A;
		} else if (adapter->xmitpriv.hw_ssn_seq_no == 2) {
			reg_hw_ssn = REG_HW_SEQ0_1_8730A + 2;
		} else if (adapter->xmitpriv.hw_ssn_seq_no == 3) {
			reg_hw_ssn = REG_HW_SEQ2_3_8730A;
		} else {
			reg_hw_ssn = REG_HW_SEQ2_3_8730A + 2;
		}

		rtw_write8(adapter, reg_hw_ssn, adapter->xmitpriv.nqos_ssn);
	}
	break;

	case HW_VAR_CHECK_TXBUF: {
		u16 rtylmtorg;
		u8 RetryLimit = 0x01;
		systime start;
		u32 passtime;
		u32 timelmt = 2000;	/* ms */
		int err;
		u8 empty;


		rtylmtorg = rtw_read16(adapter, REG_RETRY_LIMIT_SIFS_8730A + 2);

		val16 = (u16)((u16)RetryLimit | (u16)RetryLimit << 8);
		rtw_write16(adapter, REG_RETRY_LIMIT_SIFS_8730A + 2, val16);

		/* Check TX FIFO empty or not */
		empty = _FALSE;
		start = rtw_get_current_time();
		err = rtw_halmac_txfifo_wait_empty(adapter_to_dvobj(adapter), timelmt);
		if (!err) {
			empty = _TRUE;
		}
		passtime = rtw_get_passing_time_ms(start);

		if (_TRUE == empty) {
			RTW_INFO("[HW_VAR_CHECK_TXBUF] Empty in %d ms\n", passtime);
		} else if (RTW_CANNOT_RUN(adapter)) {
			RTW_WARN("[HW_VAR_CHECK_TXBUF] bDriverStopped or bSurpriseRemoved\n");
		} else {
			RTW_ERR("[HW_VAR_CHECK_TXBUF] NOT empty in %d ms\n", passtime);

		}
		rtw_write16(adapter, REG_RETRY_LIMIT_SIFS_8730A + 2, rtylmtorg);
	}
	break;
		/*
			case HW_VAR_PCIE_STOP_TX_DMA:
			case HW_VAR_APFM_ON_MAC
			case HW_VAR_HCI_SUS_STATE:
		#if defined(CONFIG_WOWLAN) || defined(CONFIG_AP_WOWLAN)
			case HW_VAR_WOWLAN:
			case HW_VAR_WAKEUP_REASON:
		#endif
			case HW_VAR_RPWM_TOG:
				break;
		*/
#ifdef CONFIG_GPIO_WAKEUP
	case HW_SET_GPIO_WL_CTRL: {
		struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(adapter);
		u8 enable = *val;
		u8 value = 0;
		u8 addr = REG_PAD_CTRL1_8730A + 3;

		if (pwrpriv->wowlan_gpio_index == 6) {
			value = rtw_read8(adapter, addr);

			if (enable == _TRUE && (value & BIT(1)))
				/* set 0x64[25] = 0 to control GPIO 6 */
			{
				rtw_write8(adapter, addr, value & (~BIT(1)));
			} else if (enable == _FALSE) {
				rtw_write8(adapter, addr, value | BIT(1));
			}

			RTW_INFO("[HW_SET_GPIO_WL_CTRL] 0x%02X=0x%02X\n",
				 addr, rtw_read8(adapter, addr));
		}
	}
	break;
#endif
	/*
		case HW_VAR_SYS_CLKR:
			break;
	*/
	case HW_VAR_NAV_UPPER: {
#define HAL_NAV_UPPER_UNIT	128	/* micro-second */
		u32 usNavUpper = *(u32 *)val;

		if (usNavUpper > HAL_NAV_UPPER_UNIT * 0xFF) {
			RTW_INFO(FUNC_ADPT_FMT ": [HW_VAR_NAV_UPPER] value(0x%08X us) is larger than (%d * 0xFF)!!!\n",
				 FUNC_ADPT_ARG(adapter), usNavUpper, HAL_NAV_UPPER_UNIT);
			break;
		}

		usNavUpper = (usNavUpper + HAL_NAV_UPPER_UNIT - 1) / HAL_NAV_UPPER_UNIT;
		rtw_write8(adapter, REG_NAV_CTRL_8730A + 2, (u8)usNavUpper);
	}
	break;

		/*
			case HW_VAR_RPT_TIMER_SETTING:
			case HW_VAR_TX_RPT_MAX_MACID:
			case HW_VAR_CHK_HI_QUEUE_EMPTY:
			case HW_VAR_AMPDU_MAX_TIME:
			case HW_VAR_USB_MODE:
				break;
		*/
#ifdef CONFIG_AP_PORT_SWAP
	case HW_VAR_PORT_SWITCH: {
		u8 mode = *((u8 *)val);

		hw_var_ap_port_switch(adapter, mode);
	}
	break;
#endif

#ifdef CONFIG_BEAMFORMING
	case HW_VAR_SOUNDING_ENTER:
		rtl8730a_phy_bf_enter(adapter, (struct sta_info *)val);
		break;

	case HW_VAR_SOUNDING_LEAVE:
		rtl8730a_phy_bf_leave(adapter, val);
		break;
	/*
		case HW_VAR_SOUNDING_RATE:
			break;
	*/
	case HW_VAR_SOUNDING_STATUS:
		rtl8730a_phy_bf_sounding_status(adapter, *val);
		break;
	/*
		case HW_VAR_SOUNDING_FW_NDPA:
		case HW_VAR_SOUNDING_CLK:
			break;
	*/
	case HW_VAR_SOUNDING_SET_GID_TABLE:
		rtl8730a_phy_bf_set_gid_table(adapter, (struct beamformer_entry *)val);
		break;

#if 0
	case HW_VAR_SOUNDING_CSI_REPORT:
		rtl8730a_phy_bf_set_csi_report(adapter, (struct _RT_CSI_INFO *)val);
		break;
#endif
#endif /* CONFIG_BEAMFORMING */
	/*
		case HW_VAR_HW_REG_TIMER_INIT:
		case HW_VAR_HW_REG_TIMER_RESTART:
		case HW_VAR_HW_REG_TIMER_START:
		case HW_VAR_HW_REG_TIMER_STOP:
			break;
	*/

	/*
		case HW_VAR_MACID_LINK:
		case HW_VAR_MACID_NOLINK:
		case HW_VAR_DUMP_MAC_QUEUE_INFO:
		case HW_VAR_ASIX_IOT:
		case HW_VAR_EN_HW_UPDATE_TSF:
		case HW_VAR_CH_SW_NEED_TO_TAKE_CARE_IQK_INFO:
		case HW_VAR_CH_SW_IQK_INFO_BACKUP:
		case HW_VAR_CH_SW_IQK_INFO_RESTORE:
			break;
	*/

	case HW_VAR_FREECNT:

		val8 = (u8) * val;

		if (val8 == 0) {
			/* disable free run counter set 0x15B0[16]=0 */
			rtw_write32(adapter, REG_FREERUN_CNT_CTRL,
				    rtw_read32(adapter, REG_FREERUN_CNT_CTRL) & (~BIT_EN_FREECNT));

			/* reset FREE_RUN_COUNTER set 0x15B0[23]=1 */
			val8 = rtw_read32(adapter, REG_FREERUN_CNT_CTRL);
			val8 |=  BIT_RESET_FREECNT_P;
			rtw_write32(adapter, REG_FREERUN_CNT_CTRL, val8);

		} else if (val8 == 1) {

			/* enable free run counter */

			/* disable first set 0x15B0[16]=0 */
			rtw_write32(adapter, REG_FREERUN_CNT_CTRL,
				    rtw_read32(adapter, REG_FREERUN_CNT_CTRL) & (~BIT_EN_FREECNT));

			/* reset FREE_RUN_COUNTER set 0x15B0[23]=1 */
			val8 = rtw_read32(adapter, REG_FREERUN_CNT_CTRL);
			val8 |=  BIT_RESET_FREECNT_P;
			rtw_write32(adapter, REG_FREERUN_CNT_CTRL, val8);

			/* enable free run counter 0x15B0[16]=1 */
			rtw_write32(adapter, REG_FREERUN_CNT_CTRL,
				    rtw_read32(adapter, REG_FREERUN_CNT_CTRL) | BIT_EN_FREECNT);
		}
		break;

	case HW_VAR_SET_SOML_PARAM:
#ifdef CONFIG_DYNAMIC_SOML
		rtw_dyn_soml_para_set(adapter, 4, 20, 1, 0);
#endif
		break;

	default:
		ret = SetHwReg(adapter, variable, val);
		break;
	}

	return ret;
}

#ifdef CONFIG_PROC_DEBUG
struct qinfo {
	u32 head: 11;
	u32 tail: 11;
	u32 empty: 1;
	u32 ac: 2;
	u32 macid: 7;
};

struct bcn_qinfo {
	u16 head: 12;
	u16 rsvd: 4;
};

