StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_ops.c
#if 0
static void dump_qinfo(void *sel, struct qinfo *info, u32 pkt_num, const char *tag)
{
	RTW_PRINT_SEL(sel, "%shead:0x%02x, tail:0x%02x, pkt_num:%u, macid:%u, ac:%u\n",
		      tag ? tag : "", info->head, info->tail, pkt_num, info->macid, info->ac);
}

static void dump_bcn_qinfo(void *sel, struct bcn_qinfo *info, u32 pkt_num, const char *tag)
{
	RTW_PRINT_SEL(sel, "%shead:0x%02x, pkt_num:%u\n",
		      tag ? tag : "", info->head, pkt_num);
}
#endif

static void dump_mac_qinfo(void *sel, _adapter *adapter)
{
#if 0	/* TODO: readd these counters */
	u32 q0_info;
	u32 q1_info;
	u32 q2_info;
	u32 q3_info;
	u32 q4_info;
	u32 q5_info;
	u32 q6_info;
	u32 q7_info;
	u32 mg_q_info;
	u32 hi_q_info;
	u16 bcn_q_info;
	u32 q0_q1_info;
	u32 q2_q3_info;
	u32 q4_q5_info;
	u32 q6_q7_info;
	u32 mg_hi_q_info;
	u32 cmd_bcn_q_info;

	q0_info = rtw_read32(adapter, REG_Q0_INFO_8730A);
	q1_info = rtw_read32(adapter, REG_Q1_INFO_8730A);
	q2_info = rtw_read32(adapter, REG_Q2_INFO_8730A);
	q3_info = rtw_read32(adapter, REG_Q3_INFO_8730A);
	q4_info = rtw_read32(adapter, REG_Q4_INFO_8730A);
	q5_info = rtw_read32(adapter, REG_Q5_INFO_8730A);
	q6_info = rtw_read32(adapter, REG_Q6_INFO_8730A);
	q7_info = rtw_read32(adapter, REG_Q7_INFO_8730A);
	mg_q_info = rtw_read32(adapter, REG_MGQ_INFO_8730A);
	hi_q_info = rtw_read32(adapter, REG_HIQ_INFO_8730A);
	bcn_q_info = rtw_read16(adapter, REG_BCNQ_INFO_8730A);

	q0_q1_info = rtw_read32(adapter, REG_Q0_Q1_INFO_8730A);
	q2_q3_info = rtw_read32(adapter, REG_Q2_Q3_INFO_8730A);
	q4_q5_info = rtw_read32(adapter, REG_Q4_Q5_INFO_8730A);
	q6_q7_info = rtw_read32(adapter, REG_Q6_Q7_INFO_8730A);
	mg_hi_q_info = rtw_read32(adapter, REG_MGQ_HIQ_INFO_8730A);
	cmd_bcn_q_info = rtw_read32(adapter, REG_CMDQ_BCNQ_INFO_8730A);

	dump_qinfo(sel, (struct qinfo *)&q0_info, q0_q1_info & 0xFFF, "Q0 ");
	dump_qinfo(sel, (struct qinfo *)&q1_info, (q0_q1_info >> 15) & 0xFFF, "Q1 ");
	dump_qinfo(sel, (struct qinfo *)&q2_info, q2_q3_info & 0xFFF, "Q2 ");
	dump_qinfo(sel, (struct qinfo *)&q3_info, (q2_q3_info >> 15) & 0xFFF, "Q3 ");
	dump_qinfo(sel, (struct qinfo *)&q4_info, q4_q5_info & 0xFFF, "Q4 ");
	dump_qinfo(sel, (struct qinfo *)&q5_info, (q4_q5_info >> 15) & 0xFFF, "Q5 ");
	dump_qinfo(sel, (struct qinfo *)&q6_info, q6_q7_info & 0xFFF, "Q6 ");
	dump_qinfo(sel, (struct qinfo *)&q7_info, (q6_q7_info >> 15) & 0xFFF, "Q7 ");
	dump_qinfo(sel, (struct qinfo *)&mg_q_info, mg_hi_q_info & 0xFFF, "MG ");
	dump_qinfo(sel, (struct qinfo *)&hi_q_info, (mg_hi_q_info >> 15) & 0xFFF, "HI ");
	dump_bcn_qinfo(sel, (struct bcn_qinfo *)&bcn_q_info, cmd_bcn_q_info & 0xFFF, "BCN ");
#endif
}

static void dump_mac_txfifo(void *sel, _adapter *adapter)
{
#if 0	/* TODO: readd these counters */
	u32 hpq, lpq, npq, epq, pubq;

	hpq = rtw_read32(adapter, REG_FIFOPAGE_INFO_1_8730A);
	lpq = rtw_read32(adapter, REG_FIFOPAGE_INFO_2_8730A);
	npq = rtw_read32(adapter, REG_FIFOPAGE_INFO_3_8730A);
	epq = rtw_read32(adapter, REG_FIFOPAGE_INFO_4_8730A);
	pubq = rtw_read32(adapter, REG_FIFOPAGE_INFO_5_8730A);

	hpq = (hpq & 0xFFF0000) >> 16;
	lpq = (lpq & 0xFFF0000) >> 16;
	npq = (npq & 0xFFF0000) >> 16;
	epq = (epq & 0xFFF0000) >> 16;
	pubq = (pubq & 0xFFF0000) >> 16;

	RTW_PRINT_SEL(sel, "Tx: available page num: ");
	if ((hpq == 0xAEA) && (hpq == lpq) && (hpq == pubq)) {
		RTW_PRINT_SEL(sel, "N/A (reg val = 0xea)\n");
	} else
		RTW_PRINT_SEL(sel, "HPQ: %d, LPQ: %d, NPQ: %d, EPQ: %d, PUBQ: %d\n"
			      , hpq, lpq, npq, epq, pubq);
#endif
}
#endif


static u8 hw_var_get_bcn_valid(PADAPTER adapter, u8 port0)
{
	u8 val8 = 0;
	u8 ret = _FALSE;

	val8 = rtw_read8(adapter, REG_DWBCN0_CTRL_8730A + 2);
	ret = (BIT(0) & val8) ? _TRUE : _FALSE;

	return ret;
}

void rtl8730a_read_wmmedca_reg(PADAPTER adapter, u16 *vo_params, u16 *vi_params, u16 *be_params, u16 *bk_params)
{
	u8 vo_reg_params[4];
	u8 vi_reg_params[4];
	u8 be_reg_params[4];
	u8 bk_reg_params[4];

	rtl8730a_gethwreg(adapter, HW_VAR_AC_PARAM_VO, vo_reg_params);
	rtl8730a_gethwreg(adapter, HW_VAR_AC_PARAM_VI, vi_reg_params);
	rtl8730a_gethwreg(adapter, HW_VAR_AC_PARAM_BE, be_reg_params);
	rtl8730a_gethwreg(adapter, HW_VAR_AC_PARAM_BK, bk_reg_params);

	vo_params[0] = vo_reg_params[0];
	vo_params[1] = vo_reg_params[1] & 0x0F;
	vo_params[2] = (vo_reg_params[1] & 0xF0) >> 4;
	vo_params[3] = ((vo_reg_params[3] << 8) | (vo_reg_params[2])) * 32;

	vi_params[0] = vi_reg_params[0];
	vi_params[1] = vi_reg_params[1] & 0x0F;
	vi_params[2] = (vi_reg_params[1] & 0xF0) >> 4;
	vi_params[3] = ((vi_reg_params[3] << 8) | (vi_reg_params[2])) * 32;

	be_params[0] = be_reg_params[0];
	be_params[1] = be_reg_params[1] & 0x0F;
	be_params[2] = (be_reg_params[1] & 0xF0) >> 4;
	be_params[3] = ((be_reg_params[3] << 8) | (be_reg_params[2])) * 32;

	bk_params[0] = bk_reg_params[0];
	bk_params[1] = bk_reg_params[1] & 0x0F;
	bk_params[2] = (bk_reg_params[1] & 0xF0) >> 4;
	bk_params[3] = ((bk_reg_params[3] << 8) | (bk_reg_params[2])) * 32;

	vo_params[1] = (1 << vo_params[1]) - 1;
	vo_params[2] = (1 << vo_params[2]) - 1;
	vi_params[1] = (1 << vi_params[1]) - 1;
	vi_params[2] = (1 << vi_params[2]) - 1;
	be_params[1] = (1 << be_params[1]) - 1;
	be_params[2] = (1 << be_params[2]) - 1;
	bk_params[1] = (1 << bk_params[1]) - 1;
	bk_params[2] = (1 << bk_params[2]) - 1;
}

void rtl8730a_gethwreg(PADAPTER adapter, u8 variable, u8 *val)
{
	PHAL_DATA_TYPE hal;
	u8 val8;
	u16 val16;
	u32 val32;
	u64 val64;


	hal = GET_HAL_DATA(adapter);

	switch (variable) {
	/*
		case HW_VAR_INIT_RTS_RATE:
		case HW_VAR_BASIC_RATE:
			break;
	*/
	case HW_VAR_TXPAUSE:
		*val = rtw_read8(adapter, REG_TXPAUSE_8730A);
		break;
	/*
		case HW_VAR_BCN_FUNC:
		case HW_VAR_MLME_DISCONNECT:
		case HW_VAR_MLME_SITESURVEY:
		case HW_VAR_MLME_JOIN:
		case HW_VAR_BEACON_INTERVAL:
		case HW_VAR_SLOT_TIME:
		case HW_VAR_RESP_SIFS:
		case HW_VAR_ACK_PREAMBLE:
		case HW_VAR_SEC_CFG:
		case HW_VAR_SEC_DK_CFG:
			break;
	*/
	case HW_VAR_BCN_VALID:
		*val = hw_var_get_bcn_valid(adapter, *val == BCN_VALID_PORT0 ? _TRUE : _FALSE);
		break;

	case HW_VAR_FREECNT:
		*val = rtw_read8(adapter, REG_FREERUN_CNT_CTRL) & BIT_EN_FREECNT;
		break;
	/*
		case HW_VAR_CAM_INVALID_ALL:
	*/
	case HW_VAR_AC_PARAM_VO:
		val32 = rtw_read32(adapter, REG_EDCA_VO_PARAM_8730A);
		val[0] = val32 & 0xFF;
		val[1] = (val32 >> 8) & 0xFF;
		val[2] = (val32 >> 16) & 0xFF;
		val[3] = (val32 >> 24) & 0x07;
		break;

	case HW_VAR_AC_PARAM_VI:
		val32 = rtw_read32(adapter, REG_EDCA_VI_PARAM_8730A);
		val[0] = val32 & 0xFF;
		val[1] = (val32 >> 8) & 0xFF;
		val[2] = (val32 >> 16) & 0xFF;
		val[3] = (val32 >> 24) & 0x07;
		break;

	case HW_VAR_AC_PARAM_BE:
		val32 = rtw_read32(adapter, REG_EDCA_BE_PARAM_8730A);
		val[0] = val32 & 0xFF;
		val[1] = (val32 >> 8) & 0xFF;
		val[2] = (val32 >> 16) & 0xFF;
		val[3] = (val32 >> 24) & 0x07;
		break;

	case HW_VAR_AC_PARAM_BK:
		val32 = rtw_read32(adapter, REG_EDCA_BK_PARAM_8730A);
		val[0] = val32 & 0xFF;
		val[1] = (val32 >> 8) & 0xFF;
		val[2] = (val32 >> 16) & 0xFF;
		val[3] = (val32 >> 24) & 0x07;
		break;
	/*
		case HW_VAR_ACM_CTRL:
		case HW_VAR_AMPDU_MIN_SPACE:
		case HW_VAR_AMPDU_FACTOR:
		case HW_VAR_RXDMA_AGG_PG_TH:
		case HW_VAR_SET_RPWM:
		case HW_VAR_CPWM:
		case HW_VAR_H2C_FW_PWRMODE:
		case HW_VAR_H2C_PS_TUNE_PARAM:
		case HW_VAR_H2C_FW_JOINBSSRPT:
			break;
	*/
	case HW_VAR_FWLPS_RF_ON:
		/* When we halt NIC, we should check if FW LPS is leave. */
		if (rtw_is_surprise_removed(adapter) ||
		    (adapter_to_pwrctl(adapter)->rf_pwrstate == rf_off)) {
			/*
			 * If it is in HW/SW Radio OFF or IPS state,
			 * we do not check Fw LPS Leave,
			 * because Fw is unload.
			 */
			*val = _TRUE;
		} else {
			rtw_hal_get_hwreg(adapter, HW_VAR_RCR, (u8 *)&val32);

			if (adapter_to_pwrctl(adapter)->wowlan_mode == _TRUE) {
				val32 &= (BIT_UCMDINT_EN_8730A | BIT_BCMDINT_EN_8730A);
			} else {
				val32 &= (BIT_UCMDINT_EN_8730A | BIT_BCMDINT_EN_8730A | BIT_TIMPSR_EN_8730A);
			}

