StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_ops.c
			if (val32) {
				*val = _FALSE;
			} else {
				*val = _TRUE;
			}
		}
		break;
		/*
			case HW_VAR_H2C_FW_P2P_PS_OFFLOAD:
			case HW_VAR_TRIGGER_GPIO_0:
			case HW_VAR_BT_SET_COEXIST:
			case HW_VAR_BT_ISSUE_DELBA:
			case HW_VAR_SWITCH_EPHY_WoWLAN:
			case HW_VAR_EFUSE_USAGE:
			case HW_VAR_EFUSE_BYTES:
			case HW_VAR_EFUSE_BT_USAGE:
			case HW_VAR_EFUSE_BT_BYTES:
			case HW_VAR_FIFO_CLEARN_UP:
			case HW_VAR_RESTORE_HW_SEQ:
			case HW_VAR_CHECK_TXBUF:
			case HW_VAR_PCIE_STOP_TX_DMA:
				break;
		*/

		/*
			case HW_VAR_HCI_SUS_STATE:
				break;
		*/
#if defined(CONFIG_WOWLAN) || defined(CONFIG_AP_WOWLAN)
		/*
			case HW_VAR_WOWLAN:
				break;

			case HW_VAR_WAKEUP_REASON:
				rtw_halmac_get_wow_reason(adapter_to_dvobj(adapter), val);
				break;

			case HW_VAR_RPWM_TOG:
				break;
		*/
#endif
	/*
	#ifdef CONFIG_GPIO_WAKEUP
		case HW_SET_GPIO_WL_CTRL:
			break;
	#endif
	*/
	case HW_VAR_SYS_CLKR:
		*val = rtw_read8(adapter, REG_WL_CLK_CTRL_8730A);
		break;
	/*
		case HW_VAR_NAV_UPPER:
		case HW_VAR_RPT_TIMER_SETTING:
		case HW_VAR_TX_RPT_MAX_MACID:
			break;
	*/
	case HW_VAR_CHK_HI_QUEUE_EMPTY:
		val32 = rtw_read32(adapter, REG_TXPKT_EMPTY_8730A);
		*val = (val32 & BIT_HQQ_EMPTY_8730A) ? _TRUE : _FALSE;
		break;
	case HW_VAR_CHK_MGQ_CPU_EMPTY:
		val32 = rtw_read32(adapter, REG_TXPKT_EMPTY_8730A);
		*val = (val32 & BIT_MGQ_CPU_EMPTY_8730A) ? _TRUE : _FALSE;
		break;
		/*
			case HW_VAR_DL_BCN_SEL:
			case HW_VAR_AMPDU_MAX_TIME:
			case HW_VAR_USB_MODE:
			case HW_VAR_PORT_SWITCH:
			case HW_VAR_DO_IQK:
			case HW_VAR_SOUNDING_ENTER:
			case HW_VAR_SOUNDING_LEAVE:
			case HW_VAR_SOUNDING_RATE:
			case HW_VAR_SOUNDING_STATUS:
			case HW_VAR_SOUNDING_FW_NDPA:
			case HW_VAR_SOUNDING_CLK:
			case HW_VAR_HW_REG_TIMER_INIT:
			case HW_VAR_HW_REG_TIMER_RESTART:
			case HW_VAR_HW_REG_TIMER_START:
			case HW_VAR_HW_REG_TIMER_STOP:
			case HW_VAR_MACID_LINK:
			case HW_VAR_MACID_NOLINK:
				break;
			case HW_VAR_FW_PS_STATE:
				break;
		*/
#ifdef CONFIG_PROC_DEBUG
	case HW_VAR_DUMP_MAC_QUEUE_INFO:
		dump_mac_qinfo(val, adapter);
		break;

	case HW_VAR_DUMP_MAC_TXFIFO:
		dump_mac_txfifo(val, adapter);
		break;
#endif
	/*
		case HW_VAR_ASIX_IOT:
		case HW_VAR_EN_HW_UPDATE_TSF:
		case HW_VAR_CH_SW_NEED_TO_TAKE_CARE_IQK_INFO:
		case HW_VAR_CH_SW_IQK_INFO_BACKUP:
		case HW_VAR_CH_SW_IQK_INFO_RESTORE:
	#ifdef CONFIG_TDLS
	#ifdef CONFIG_TDLS_CH_SW
		case HW_VAR_BCN_EARLY_C2H_RPT:
	#endif
	#endif
			break;
	*/

	case HW_VAR_BCN_CTRL_ADDR:
		*((u32 *)val) = hw_bcn_ctrl_addr(adapter, adapter->hw_port);
		break;

	default:
		GetHwReg(adapter, variable, val);
		break;
	}
}

/*
 * Description:
 *	Change default setting of specified variable.
 */
u8 rtl8730a_sethaldefvar(PADAPTER adapter, HAL_DEF_VARIABLE variable, void *pval)
{
	PHAL_DATA_TYPE hal;
	u8 bResult;


	hal = GET_HAL_DATA(adapter);
	bResult = _SUCCESS;

	switch (variable) {
	/*
		case HAL_DEF_UNDERCORATEDSMOOTHEDPWDB:
		case HAL_DEF_IS_SUPPORT_ANT_DIV:
		case HAL_DEF_DRVINFO_SZ:
		case HAL_DEF_MAX_RECVBUF_SZ:
		case HAL_DEF_RX_PACKET_OFFSET:
		case HAL_DEF_RX_DMA_SZ_WOW:
		case HAL_DEF_RX_DMA_SZ:
		case HAL_DEF_RX_PAGE_SIZE:
		case HAL_DEF_DBG_DUMP_RXPKT:
		case HAL_DEF_RA_DECISION_RATE:
		case HAL_DEF_RA_SGI:
		case HAL_DEF_PT_PWR_STATUS:
		case HAL_DEF_TX_LDPC:
		case HAL_DEF_RX_LDPC:
		case HAL_DEF_TX_STBC:
		case HAL_DEF_RX_STBC:
		case HAL_DEF_EXPLICIT_BEAMFORMER:
		case HAL_DEF_EXPLICIT_BEAMFORMEE:
		case HAL_DEF_VHT_MU_BEAMFORMER:
		case HAL_DEF_VHT_MU_BEAMFORMEE:
		case HAL_DEF_BEAMFORMER_CAP:
		case HAL_DEF_BEAMFORMEE_CAP:
		case HW_VAR_MAX_RX_AMPDU_FACTOR:
		case HAL_DEF_DBG_DUMP_TXPKT:
		case HAL_DEF_TX_PAGE_SIZE:
		case HAL_DEF_TX_PAGE_BOUNDARY:
		case HAL_DEF_TX_PAGE_BOUNDARY_WOWLAN:
		case HAL_DEF_ANT_DETECT:
		case HAL_DEF_PCI_SUUPORT_L1_BACKDOOR:
		case HAL_DEF_PCI_AMD_L1_SUPPORT:
		case HAL_DEF_PCI_ASPM_OSC:
		case HAL_DEF_EFUSE_USAGE:
		case HAL_DEF_EFUSE_BYTES:
		case HW_VAR_BEST_AMPDU_DENSITY:
			break;
	*/
	default:
		bResult = SetHalDefVar(adapter, variable, pval);
		break;
	}

	return bResult;
}
void rtl8730a_ra_info_dump(_adapter *padapter, void *sel)
{
	u8 mac_id;
	struct sta_info *psta;
	u32 rate_mask1, rate_mask2;
	struct dvobj_priv *dvobj = adapter_to_dvobj(padapter);
	struct macid_ctl_t *macid_ctl = dvobj_to_macidctl(dvobj);

	for (mac_id = 0; mac_id < macid_ctl->num; mac_id++) {
		if (rtw_macid_is_used(macid_ctl, mac_id) && !rtw_macid_is_bmc(macid_ctl, mac_id)) {
			psta = macid_ctl->sta[mac_id];
			if (!psta) {
				continue;
			}

			dump_sta_info(sel, psta);
			rate_mask1 = macid_ctl->rate_bmp0[mac_id];
			rate_mask2 = macid_ctl->rate_bmp1[mac_id];
			_RTW_PRINT_SEL(sel, "rate_mask2:0x%08x, rate_mask1:0x%08x\n", rate_mask2, rate_mask1);
		}
	}
}
/*
 * Description:
 *	Query setting of specified variable.
 */
u8 rtl8730a_gethaldefvar(PADAPTER adapter, HAL_DEF_VARIABLE variable, void *pval)
{
	PHAL_DATA_TYPE hal;
	struct dvobj_priv *d;
	u8 bResult;
	u8 val8 = 0;
	u32 val32 = 0;


	d = adapter_to_dvobj(adapter);
	hal = GET_HAL_DATA(adapter);
	bResult = _SUCCESS;

	switch (variable) {
	/*
		case HAL_DEF_UNDERCORATEDSMOOTHEDPWDB:
			break;
	*/
	case HAL_DEF_IS_SUPPORT_ANT_DIV:
#ifdef CONFIG_ANTENNA_DIVERSITY
		*(u8 *)pval = _TRUE;
#else
		*(u8 *)pval = _FALSE;
#endif
		break;

	/*
		case HAL_DEF_DRVINFO_SZ:
			break;
	*/
	case HAL_DEF_MAX_RECVBUF_SZ:
		*((u32 *)pval) = MAX_RECVBUF_SZ;
		break;

	case HAL_DEF_RX_PACKET_OFFSET:
		val32 = rtl8730a_get_rx_desc_size(adapter);
		val8 = rtl8730a_get_rx_drv_info_size(adapter);
		*((u32 *)pval) = val32 + val8;
		break;
	/*
		case HAL_DEF_RX_DMA_SZ_WOW:
		case HAL_DEF_RX_DMA_SZ:
		case HAL_DEF_RX_PAGE_SIZE:
		case HAL_DEF_DBG_DUMP_RXPKT:
		case HAL_DEF_RA_DECISION_RATE:
		case HAL_DEF_RA_SGI:
			break;
	*/
	/* only for 8188E */
	case HAL_DEF_PT_PWR_STATUS:
		break;

	case HAL_DEF_TX_LDPC:
	case HAL_DEF_RX_LDPC:
		*(u8 *)pval = _FALSE;
		break;

	/* support 1RX for STBC */
	case HAL_DEF_RX_STBC:
		*(u8 *)pval = 1;
		break;

	/* support Explicit TxBF for HT/VHT */
	case HAL_DEF_EXPLICIT_BEAMFORMER:
	case HAL_DEF_EXPLICIT_BEAMFORMEE:
	case HAL_DEF_VHT_MU_BEAMFORMER:
	case HAL_DEF_VHT_MU_BEAMFORMEE:
		*(u8 *)pval = _FALSE;
		break;

	case HAL_DEF_BEAMFORMER_CAP:
		val8 = GET_HAL_TX_NSS(adapter);
		*(u8 *)pval = (val8 - 1);
		break;

