StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_ops.c
void rtl8730a_fill_txdesc_force_bmc_camid(struct pkt_attrib *pattrib, u8 *ptxdesc)
{
	if ((pattrib->encrypt > 0) && (!pattrib->bswenc)
	    && (pattrib->bmc_camid != INVALID_SEC_MAC_CAM_ID)) {
		SET_TX_DESC_EN_DESC_ID_8730A(ptxdesc, 1);
		SET_TX_DESC_MACID_8730A(ptxdesc, pattrib->bmc_camid);
	}
}

void rtl8730a_fill_txdesc_bmc_tx_rate(struct pkt_attrib *pattrib, u8 *ptxdesc)
{
	SET_TX_DESC_USE_RATE_8730A(ptxdesc, 1);
	SET_TX_DESC_DATARATE_8730A(ptxdesc, MRateToHwRate(pattrib->rate));
	SET_TX_DESC_DISDATAFB_8730A(ptxdesc, 1);
}

/*
 * Description:
 *	Fill tx description for beamforming packets
 */
void rtl8730a_fill_txdesc_bf(struct xmit_frame *frame, u8 *desc)
{
#ifndef CONFIG_BEAMFORMING
	return;
#else /* CONFIG_BEAMFORMING */
	struct pkt_attrib *attrib;
	struct _ADAPTER *padapter = frame->padapter;
	struct hal_com_data *pHalData = GET_HAL_DATA(padapter);
	u8 init_rate;

	attrib = &frame->attrib;
	init_rate = pHalData->INIDATA_RATE[attrib->mac_id] & 0x7F;

	SET_TX_DESC_G_ID_8730A(desc, attrib->txbf_g_id);
	SET_TX_DESC_P_AID_8730A(desc, attrib->txbf_p_aid);

	SET_TX_DESC_MU_DATARATE_8730A(desc, init_rate);
	/*SET_TX_DESC_BUFFER_MU_RC_8730A(desc, 0);*/

	/* Force to disable STBC when txbf is enabled */
	if (attrib->txbf_p_aid && attrib->stbc) {
		SET_TX_DESC_DATA_STBC_8730A(desc, 0);
	}
#endif /* CONFIG_BEAMFORMING */
}

/*
 * Description:
 *	Fill tx description for beamformer,
 *	include following management packets:
 *	1. VHT NDPA
 *	2. HT NDPA
 *	3. Beamforming Report Poll
 */
void rtl8730a_fill_txdesc_mgnt_bf(struct xmit_frame *frame, u8 *desc)
{
#ifndef CONFIG_BEAMFORMING
	return;
#else /* CONFIG_BEAMFORMING */
	PADAPTER adapter;
	struct pkt_attrib *attrib;
	u8 ndpa = 0;
	u8 ht_ndpa = 0;
	u8 report_poll = 0;


	adapter = frame->padapter;
	attrib = &frame->attrib;

	if (attrib->subtype == WIFI_NDPA) {
		ndpa = 1;
	}
	if ((attrib->subtype == WIFI_ACTION_NOACK) && (attrib->order == 1)) {
		ht_ndpa = 1;
	}
	if (attrib->subtype == WIFI_BF_REPORT_POLL) {
		report_poll = 1;
	}

	if ((!ndpa) && (!ht_ndpa) && (!report_poll)) {
		return;
	}

	/*SET_TX_DESC_TXPKTSIZE_8730A(desc, pattrib->last_txcmdsz);*/
	/*SET_TX_DESC_OFFSET_8730A(desc, HALMAC_TX_DESC_BUFFER_SIZE_8730A);*/
	SET_TX_DESC_DISRTSFB_8730A(desc, 1);
	SET_TX_DESC_DISDATAFB(desc, 1);
	/*SET_TX_DESC_SW_SEQ_8730A(desc, pattrib->seqnum);*/
	SET_TX_DESC_DATA_BW_8730A(desc, rtl8730a_bw_mapping(adapter, attrib));
	SET_TX_DESC_SIGNALING_TA_PKT_SC_8730A(desc,
					      rtl8730a_sc_mapping(adapter, attrib));
	/*SET_TX_DESC_RTY_LMT_EN_8730A(ptxdesc, 1);*/
	SET_TX_DESC_RTS_DATA_RTY_LMT_8730A(desc, 5);
	SET_TX_DESC_NDPA_8730A(desc, 1);
	SET_TX_DESC_NAVUSEHDR_8730A(desc, 1);
	/*SET_TX_DESC_QSEL_8730A(desc, QSLT_MGNT);*/
	/*
	 * NSS2MCS0 for VHT
	 * MCS8 for HT
	 */
	SET_TX_DESC_DATARATE_8730A(desc, MRateToHwRate(attrib->rate));
	/*SET_TX_DESC_USE_RATE_8730A(desc, 1);*/
	/*SET_TX_DESC_MACID_8730A(desc, pattrib->mac_id);*/ /* ad-hoc mode */
	/*SET_TX_DESC_G_ID_8730A(desc, 63);*/
	/*
	 * partial AID of 1st STA, at infrastructure mode, either SU or MU;
	 * MACID, at ad-hoc mode
	 *
	 * For WMAC to restore the received CSI report of STA1.
	 * WMAC would set p_aid field to 0 in PLCP header for MU.
	 */
	/*SET_TX_DESC_P_AID_8730A(desc, pattrib->txbf_p_aid);*/
	SET_TX_DESC_SND_PKT_SEL_8730A(desc, attrib->bf_pkt_type);
#endif /* CONFIG_BEAMFORMING */
}

void rtl8730a_cal_txdesc_chksum(PADAPTER adapter, u8 *ptxdesc)
{
#if defined(CONFIG_USB_HCI)
	struct halmac_adapter *halmac;
	struct halmac_api *api;


	halmac = adapter_to_halmac(adapter);
	api = HALMAC_GET_API(halmac);

	api->halmac_fill_txdesc_checksum(halmac, ptxdesc);
#endif
}


#ifdef CONFIG_MP_INCLUDED
void rtl8730a_prepare_mp_txdesc(PADAPTER adapter, struct mp_priv *pmp_priv)
{
	u8 *desc;
	struct pkt_attrib *attrib;
	struct hal_com_data *hal = GET_HAL_DATA(adapter);
	u32 pkt_size;
	s32 bmcast;
	u32 desc_size;
	u8 data_rate, pwr_status, offset;
	u8 pkt_offset = TX_DESC_PKT_OFFSET_8730A >> 3;	/* 8730A pkt_offset is 32/8 */


	desc = pmp_priv->tx.desc;
	attrib = &pmp_priv->tx.attrib;
	pkt_size = attrib->last_txcmdsz;
	bmcast = IS_MCAST(attrib->ra);
	desc_size = rtl8730a_get_tx_desc_size(adapter);

	/* TODO: 8730A doesn't have this one, and only usb use it */
	/*SET_TX_DESC_BUFFER_LS_8730A(desc, 1);*/
	SET_TX_DESC_TXPKTSIZE_8730A(desc, pkt_size);

	offset = desc_size;
	SET_TX_DESC_OFFSET_8730A(desc, offset);
#if defined(CONFIG_AXI_HCI)
	SET_TX_DESC_PKT_OFFSET_8730A(desc, pkt_offset);
#else
	SET_TX_DESC_PKT_OFFSET_8730A(desc, pkt_offset + 1);
#endif
	if (bmcast) {
		SET_TX_DESC_BMC_8730A(desc, 1);
	}

	SET_TX_DESC_MACID_8730A(desc, attrib->mac_id);
	SET_TX_DESC_RATE_ID_8730A(desc, attrib->raid);
	SET_TX_DESC_QSEL_8730A(desc, attrib->qsel);

	if (pmp_priv->preamble) {
		SET_TX_DESC_DATA_SHORT_8730A(desc, 1);
	}

	if (!attrib->qos_en) {
		SET_TX_DESC_EN_HWSEQ_8730A(desc, 1);
	} else {
		SET_TX_DESC_SW_SEQ_8730A(desc, attrib->seqnum);
	}

	if (pmp_priv->bandwidth <= CHANNEL_WIDTH_160) {
		SET_TX_DESC_DATA_BW_8730A(desc, pmp_priv->bandwidth);
	} else {
		RTW_ERR("%s: unknown bandwidth %d, use 20M\n",
			__FUNCTION__, pmp_priv->bandwidth);
		SET_TX_DESC_DATA_BW_8730A(desc, CHANNEL_WIDTH_20);
	}

	SET_TX_DESC_DISDATAFB_8730A(desc, 1);
	SET_TX_DESC_USE_RATE_8730A(desc, 1);
	SET_TX_DESC_DATARATE_8730A(desc, pmp_priv->rateidx);
}
#endif /* CONFIG_MP_INCLUDED */

static void fill_default_txdesc(struct xmit_frame *pxmitframe, u8 *pbuf)
{
	PADAPTER adapter;
	PHAL_DATA_TYPE hal;
	struct mlme_ext_priv *pmlmeext;
	struct mlme_ext_info *pmlmeinfo;
	struct pkt_attrib *pattrib;
	s32 bmcst;
	u32 desc_size;
	u8 hw_port;

	adapter = pxmitframe->padapter;
	hal = GET_HAL_DATA(adapter);
	pmlmeext = &adapter->mlmeextpriv;
	pmlmeinfo = &(pmlmeext->mlmext_info);

	pattrib = &pxmitframe->attrib;
	bmcst = IS_MCAST(pattrib->ra);
	hw_port = rtw_hal_get_port(adapter);

	desc_size = rtl8730a_get_tx_desc_size(adapter);
	_rtw_memset(pbuf, 0, desc_size);

	if (pxmitframe->frame_tag == DATA_FRAMETAG) {
		u8 drv_userate = 0;

		SET_TX_DESC_MACID_8730A(pbuf, pattrib->mac_id);
		SET_TX_DESC_RATE_ID_8730A(pbuf, pattrib->raid);
		SET_TX_DESC_QSEL_8730A(pbuf, pattrib->qsel);
		SET_TX_DESC_SW_SEQ_8730A(pbuf, pattrib->seqnum);

		rtl8730a_fill_txdesc_sectype(pattrib, pbuf);
		rtl8730a_fill_txdesc_vcs(adapter, pattrib, pbuf);

