StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_ops.c
		if (bmcst) {
			rtl8730a_fill_txdesc_force_bmc_camid(pattrib, pbuf);
		}

#ifdef CONFIG_P2P
		if (!rtw_p2p_chk_state(&adapter->wdinfo, P2P_STATE_NONE)) {
			if (pattrib->icmp_pkt == 1 && adapter->registrypriv.wifi_spec == 1) {
				drv_userate = 1;
			}
		}
#endif

		if ((pattrib->ether_type != 0x888e) &&
		    (pattrib->ether_type != 0x0806) &&
		    (pattrib->ether_type != 0x88B4) &&
		    (pattrib->dhcp_pkt != 1) &&
		    (drv_userate != 1)
#ifdef CONFIG_AUTO_AP_MODE
		    && (pattrib->pctrl != _TRUE)
#endif
		   ) {
			/* Non EAP & ARP & DHCP type data packet */

			if (pattrib->ampdu_en == _TRUE) {
				SET_TX_DESC_AGG_EN_8730A(pbuf, 1);
				SET_TX_DESC_MAX_AGG_NUM_8730A(pbuf, 0x1F);
				SET_TX_DESC_AMPDU_DENSITY_8730A(pbuf, pattrib->ampdu_spacing);
			} else {
				SET_TX_DESC_BK_8730A(pbuf, 1);
			}

			rtl8730a_fill_txdesc_phy(adapter, pattrib, pbuf);

			/* compatibility for MCC consideration, use pmlmeext->cur_channel */
			if (!bmcst) {
				if (pmlmeext->cur_channel > 14)
					/* for 5G, OFDM 6M */
				{
					SET_TX_DESC_DATA_RTY_LOWEST_RATE_8730A(pbuf, 4);
				} else
					/* for 2.4G, CCK 1M */
				{
					SET_TX_DESC_DATA_RTY_LOWEST_RATE_8730A(pbuf, 0);
				}
			}

			if (hal->fw_ractrl == _FALSE)
				rtl8730a_fill_txdesc_tx_rate(adapter, pattrib,
							     hal->INIDATA_RATE[pattrib->mac_id] & 0x7F,
							     hal->INIDATA_RATE[pattrib->mac_id] & BIT(7) ? 1 : 0,
							     1, pbuf);

			if (bmcst) {
				SET_TX_DESC_SW_DEFINE_8730A(pbuf, 0x01);
				rtl8730a_fill_txdesc_bmc_tx_rate(pattrib, pbuf);
			}

			/* modify data rate by iwpriv */
			if (adapter->fix_rate != 0xFF)
				rtl8730a_fill_txdesc_tx_rate(adapter, pattrib,
							     adapter->fix_rate & 0x7F,
							     adapter->fix_rate & BIT(7) ? 1 : 0,
							     adapter->data_fb, pbuf);

			if (pattrib->ldpc) {
				SET_TX_DESC_DATA_LDPC_8730A(pbuf, 1);
			}
			if (pattrib->stbc) {
				SET_TX_DESC_DATA_STBC_8730A(pbuf, 1);
			}

#ifdef CONFIG_CMCC_TEST
			SET_TX_DESC_DATA_SHORT_8730A(pbuf, 1); /* use cck short premble */
#endif

#ifdef CONFIG_WMMPS_STA
			if (pattrib->trigger_frame) {
				SET_TX_DESC_TRI_FRAME_8730A(pbuf, 1);
			}
#endif /* CONFIG_WMMPS_STA */

		} else {
			/*
			 * EAP data packet and ARP packet.
			 * Use the 1M data rate to send the EAP/ARP packet.
			 * This will maybe make the handshake smooth.
			 */

			SET_TX_DESC_BK_8730A(pbuf, 1);
			SET_TX_DESC_USE_RATE_8730A(pbuf, 1);
			if (pmlmeinfo->preamble_mode == PREAMBLE_SHORT) {
				SET_TX_DESC_DATA_SHORT_8730A(pbuf, 1);
			}
#ifdef CONFIG_IP_R_MONITOR
			if ((pattrib->ether_type == ETH_P_ARP) &&
			    (IsSupportedTxOFDM(adapter->registrypriv.wireless_mode))) {
				SET_TX_DESC_DATARATE_8730A(pbuf, MRateToHwRate(IEEE80211_OFDM_RATE_6MB));
			} else
#endif/*CONFIG_IP_R_MONITOR*/
				SET_TX_DESC_DATARATE_8730A(pbuf, MRateToHwRate(pmlmeext->tx_rate));

			RTW_INFO(FUNC_ADPT_FMT ": SP Packet(0x%04X) rate=0x%x SeqNum = %d\n",
				 FUNC_ADPT_ARG(adapter), pattrib->ether_type, MRateToHwRate(pmlmeext->tx_rate), pattrib->seqnum);

		}

#if defined(CONFIG_SDIO_HCI) || defined(CONFIG_GSPI_HCI)
		SET_TX_DESC_DMA_TXAGG_NUM_8730A(pbuf, pxmitframe->agg_num);
#endif

#ifdef CONFIG_TDLS
#ifdef CONFIG_XMIT_ACK
		/* CCX-TXRPT ack for xmit mgmt frames. */
		if (pxmitframe->ack_report) {
#ifdef DBG_CCX
			RTW_INFO("%s set spe_rpt\n", __func__);
#endif
			SET_TX_DESC_SPE_RPT_8730A(pbuf, 1);
			SET_TX_DESC_SW_DEFINE_8730A(pbuf, (u8)(GET_PRIMARY_ADAPTER(adapter)->xmitpriv.seq_no));
		}
#endif /* CONFIG_XMIT_ACK */
#endif
	} else if (pxmitframe->frame_tag == MGNT_FRAMETAG) {
		SET_TX_DESC_MACID_8730A(pbuf, pattrib->mac_id);
		SET_TX_DESC_QSEL_8730A(pbuf, pattrib->qsel);
		SET_TX_DESC_RATE_ID_8730A(pbuf, pattrib->raid);
		SET_TX_DESC_SW_SEQ_8730A(pbuf, pattrib->seqnum);
		SET_TX_DESC_USE_RATE_8730A(pbuf, 1);

		SET_TX_DESC_MBSSID_8730A(pbuf, pattrib->mbssid & 0xF);

		if (pattrib->rate) {
			SET_TX_DESC_DATARATE_8730A(pbuf, MRateToHwRate(pattrib->rate));
		} else {
			SET_TX_DESC_DATARATE_8730A(pbuf, MRateToHwRate(pmlmeext->tx_rate));
		}

		SET_TX_DESC_RTY_LMT_EN_8730A(pbuf, 1);
		if (pattrib->retry_ctrl == _TRUE) {
			SET_TX_DESC_RTS_DATA_RTY_LMT_8730A(pbuf, 6);
		} else {
			SET_TX_DESC_RTS_DATA_RTY_LMT_8730A(pbuf, 12);
		}

		rtl8730a_fill_txdesc_mgnt_bf(pxmitframe, pbuf);

#ifdef CONFIG_XMIT_ACK
		/* CCX-TXRPT ack for xmit mgmt frames. */
		if (pxmitframe->ack_report) {
#ifdef DBG_CCX
			RTW_INFO("%s set spe_rpt\n", __FUNCTION__);
#endif
			SET_TX_DESC_SPE_RPT_8730A(pbuf, 1);
			SET_TX_DESC_SW_DEFINE_8730A(pbuf, (u8)(GET_PRIMARY_ADAPTER(adapter)->xmitpriv.seq_no));
		}
#endif /* CONFIG_XMIT_ACK */
	} else if (pxmitframe->frame_tag == TXAGG_FRAMETAG) {
		RTW_INFO("%s: TXAGG_FRAMETAG\n", __FUNCTION__);
	}
#ifdef CONFIG_MP_INCLUDED
	else if (pxmitframe->frame_tag == MP_FRAMETAG) {
		RTW_DBG("%s: MP_FRAMETAG\n", __FUNCTION__);
		fill_txdesc_for_mp(adapter, pbuf);
	}
#endif
	else {
		RTW_INFO("%s: frame_tag=0x%x\n", __FUNCTION__, pxmitframe->frame_tag);

		SET_TX_DESC_MACID_8730A(pbuf, pattrib->mac_id);
		SET_TX_DESC_RATE_ID_8730A(pbuf, pattrib->raid);
		SET_TX_DESC_QSEL_8730A(pbuf, pattrib->qsel);
		SET_TX_DESC_SW_SEQ_8730A(pbuf, pattrib->seqnum);
		SET_TX_DESC_USE_RATE_8730A(pbuf, 1);
		SET_TX_DESC_DATARATE_8730A(pbuf, MRateToHwRate(pmlmeext->tx_rate));
	}

	SET_TX_DESC_TXPKTSIZE_8730A(pbuf, pattrib->last_txcmdsz);
	{
		u8 offset, pkt_offset;

		offset = desc_size;
		pkt_offset = TX_DESC_PKT_OFFSET_8730A >> 3;

#ifdef CONFIG_TX_EARLY_MODE
		if (pxmitframe->frame_tag == DATA_FRAMETAG) {
			pkt_offset += 1;
			offset += EARLY_MODE_INFO_SIZE;
		}
#endif /* CONFIG_TX_EARLY_MODE */

		SET_TX_DESC_PKT_OFFSET_8730A(pbuf, pkt_offset);
		SET_TX_DESC_OFFSET_8730A(pbuf, offset);
#ifdef CONFIG_TCP_CSUM_OFFLOAD_TX
		if (pattrib->hw_csum == 1) {
			int offset = 48 + pkt_offset * 8 + 24;
//#error "check pkt_offset"

			SET_TX_DESC_OFFSET_8730A(pbuf, offset);
			SET_TX_DESC_CHK_EN_8730A(pbuf, 1);
			SET_TX_DESC_WHEADER_LEN_8730A(pbuf, (pattrib->hdrlen + pattrib->iv_len) >> 1);
		}
#endif
	}

