StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_ops.c
	if (bmcst) {
		SET_TX_DESC_BMC_8730A(pbuf, 1);
	}

	/*
	 * 2009.11.05. tynli_test. Suggested by SD4 Filen for FW LPS.
	 * (1) The sequence number of each non-Qos frame / broadcast / multicast /
	 * mgnt frame should be controlled by Hw because Fw will also send null data
	 * which we cannot control when Fw LPS enable.
	 * --> default enable non-Qos data sequense number. 2010.06.23. by tynli.
	 * (2) Enable HW SEQ control for beacon packet, because we use Hw beacon.
	 * (3) Use HW Qos SEQ to control the seq num of Ext port non-Qos packets.
	 * 2010.06.23. Added by tynli.
	 */
	if (!pattrib->qos_en) {
		SET_TX_DESC_EN_HWSEQ_8730A(pbuf, 1);
		SET_TX_DESC_HW_SSN_SEL_8730A(pbuf, pattrib->hw_ssn_sel);
	}

	/* TODO: no port ID field, but multiple port is existing so it may be ok */
	/*SET_TX_DESC_BUFFER_PORT_ID_8730A(pbuf, hw_port);*/
	SET_TX_DESC_MULTI_PORT_ID_8730A(pbuf, hw_port);

#ifdef CONFIG_ANTENNA_DIVERSITY
	if (!bmcst && pattrib->psta) {
		odm_set_tx_ant_by_tx_info(adapter_to_phydm(adapter), pbuf, pattrib->psta->cmn.mac_id);
	}
#endif

	rtl8730a_fill_txdesc_bf(pxmitframe, pbuf);
}

/*
 * Description:
 *
 * Parameters:
 *	pxmitframe	xmitframe
 *	pbuf		where to fill tx desc
 */
void rtl8730a_update_txdesc(struct xmit_frame *pxmitframe, u8 *pbuf)
{
	fill_default_txdesc(pxmitframe, pbuf);
	rtl8730a_cal_txdesc_chksum(pxmitframe->padapter, pbuf);
}

/*
 * Description:
 *	In normal chip, we should send some packet to HW which will be used by FW
 *	in FW LPS mode.
 *	The function is to fill the Tx descriptor of this packets,
 *	then FW can tell HW to send these packet directly.
 */
static void fill_fake_txdesc(PADAPTER adapter, u8 *pDesc, u32 BufferLen,
			     u8 IsPsPoll, u8 IsBTQosNull, u8 bDataFrame)
{
	/* Clear all status */
	struct mlme_ext_priv	*pmlmeext = &adapter->mlmeextpriv;
	struct xmit_priv		*pxmitpriv = &adapter->xmitpriv;
	struct hal_com_data		*hal = GET_HAL_DATA(adapter);
	u32 desc_size;
	u8 pkt_offset = TX_DESC_PKT_OFFSET_8730A >> 3;
	u8 hw_port = rtw_hal_get_port(adapter);

	desc_size = rtl8730a_get_tx_desc_size(adapter);
	_rtw_memset(pDesc, 0, desc_size);

	/* TODO: 8730A doesn't have this one, and only usb use it */
	/*SET_TX_DESC_BUFFER_LS_8730A(pDesc, 1);*/

	SET_TX_DESC_OFFSET_8730A(pDesc, desc_size);
	SET_TX_DESC_PKT_OFFSET_8730A(pDesc, pkt_offset);

	SET_TX_DESC_TXPKTSIZE_8730A(pDesc, BufferLen);
	SET_TX_DESC_QSEL_8730A(pDesc, QSLT_MGNT); /* Fixed queue of Mgnt queue */

	if (pmlmeext->cur_wireless_mode & WIRELESS_11B) {
		SET_TX_DESC_RATE_ID_8730A(pDesc, RATEID_IDX_B);
	} else {
		SET_TX_DESC_RATE_ID_8730A(pDesc, RATEID_IDX_G);
	}

	/* Set NAVUSEHDR to prevent Ps-poll AId filed to be changed to error vlaue by HW */
	if (_TRUE == IsPsPoll) {
		SET_TX_DESC_NAVUSEHDR_8730A(pDesc, 1);
	} else {
		SET_TX_DESC_EN_HWSEQ_8730A(pDesc, 1);
		SET_TX_DESC_HW_SSN_SEL_8730A(pDesc, pxmitpriv->hw_ssn_seq_no);/*pattrib->hw_ssn_sel*/
	}

	if (_TRUE == IsBTQosNull) {
		SET_TX_DESC_BT_NULL_8730A(pDesc, 1);
	}

	SET_TX_DESC_USE_RATE_8730A(pDesc, 1);
	SET_TX_DESC_DATARATE_8730A(pDesc, MRateToHwRate(pmlmeext->tx_rate));

#ifdef CONFIG_MCC_MODE
	/* config Null data retry number */
	if (IsPsPoll == _FALSE && IsBTQosNull == _FALSE && bDataFrame == _FALSE) {
		if (rtw_hal_check_mcc_status(adapter, MCC_STATUS_PROCESS_MCC_START_SETTING)) {
			u8 rty_num = adapter->mcc_adapterpriv.null_rty_num;
			if (rty_num != 0) {
				SET_TX_DESC_RTY_LMT_EN_8730A(pDesc, 1);
				SET_TX_DESC_RTS_DATA_RTY_LMT_8730A(pDesc, rty_num);
			}
		}
	}
#endif


	/*
	 * Encrypt the data frame if under security mode excepct null data.
	 */
	if (_TRUE == bDataFrame) {
		u32 EncAlg;

		EncAlg = adapter->securitypriv.dot11PrivacyAlgrthm;
		switch (EncAlg) {
		case _NO_PRIVACY_:
			SET_TX_DESC_SEC_TYPE_8730A(pDesc, 0x0);
			break;
		case _WEP40_:
		case _WEP104_:
		case _TKIP_:
			SET_TX_DESC_SEC_TYPE_8730A(pDesc, 0x1);
			break;
		case _SMS4_:
			SET_TX_DESC_SEC_TYPE_8730A(pDesc, 0x2);
			break;
		case _AES_:
			SET_TX_DESC_SEC_TYPE_8730A(pDesc, 0x3);
			break;
		case _CCMP_256_:
		case _GCMP_:
		case _GCMP_256_:
			SET_TX_DESC_SEC_TYPE_8730A(pDesc, 0x2);
			break;
		default:
			SET_TX_DESC_SEC_TYPE_8730A(pDesc, 0x0);
			break;
		}
	}

	/* TODO: no port ID field, but multiple port is existing so it may be ok */
	/*SET_TX_DESC_BUFFER_PORT_ID_8730A(pDesc, hw_port);*/
	SET_TX_DESC_MULTI_PORT_ID_8730A(pDesc, hw_port);
#if defined(CONFIG_USB_HCI) || defined(CONFIG_SDIO_HCI) || defined(CONFIG_GSPI_HCI)
	/*
	 * USB interface drop packet if the checksum of descriptor isn't correct.
	 * Using this checksum can let hardware recovery from packet bulk out error (e.g. Cancel URC, Bulk out error.).
	 */
	rtl8730a_cal_txdesc_chksum(adapter, pDesc);
#endif
}

void rtl8730a_dbg_dump_tx_desc(PADAPTER adapter, int frame_tag, u8 *ptxdesc)
{
	u8 bDumpTxPkt;
	u8 bDumpTxDesc = _FALSE;


	rtw_hal_get_def_var(adapter, HAL_DEF_DBG_DUMP_TXPKT, &bDumpTxPkt);

	/* 1 for data frame, 2 for mgnt frame */
	if (bDumpTxPkt == 1) {
		RTW_INFO("dump tx_desc for data frame\n");
		if ((frame_tag & 0x0f) == DATA_FRAMETAG) {
			bDumpTxDesc = _TRUE;
		}
	} else if (bDumpTxPkt == 2) {
		RTW_INFO("dump tx_desc for mgnt frame\n");
		if ((frame_tag & 0x0f) == MGNT_FRAMETAG) {
			bDumpTxDesc = _TRUE;
		}
	}

	/* 8730A TX SIZE = 48(HALMAC_TX_DESC_BUFFER_SIZE_8730A) */
	if (_TRUE == bDumpTxDesc) {
		RTW_INFO("=====================================\n");
		RTW_INFO("Offset00(0x%08x)\n", *((u32 *)(ptxdesc)));
		RTW_INFO("Offset04(0x%08x)\n", *((u32 *)(ptxdesc + 4)));
		RTW_INFO("Offset08(0x%08x)\n", *((u32 *)(ptxdesc + 8)));
		RTW_INFO("Offset12(0x%08x)\n", *((u32 *)(ptxdesc + 12)));
		RTW_INFO("Offset16(0x%08x)\n", *((u32 *)(ptxdesc + 16)));
		RTW_INFO("Offset20(0x%08x)\n", *((u32 *)(ptxdesc + 20)));
		RTW_INFO("Offset24(0x%08x)\n", *((u32 *)(ptxdesc + 24)));
		RTW_INFO("Offset28(0x%08x)\n", *((u32 *)(ptxdesc + 28)));
		RTW_INFO("Offset32(0x%08x)\n", *((u32 *)(ptxdesc + 32)));
		RTW_INFO("Offset36(0x%08x)\n", *((u32 *)(ptxdesc + 36)));
		RTW_INFO("Offset40(0x%08x)\n", *((u32 *)(ptxdesc + 40)));
		RTW_INFO("Offset44(0x%08x)\n", *((u32 *)(ptxdesc + 44)));
		RTW_INFO("=====================================\n");
	}
}
/* xmit section */
void rtl8730a_init_xmit_priv(_adapter *adapter)
{
	struct xmit_priv *pxmitpriv = &adapter->xmitpriv;

	pxmitpriv->hw_ssn_seq_no = rtw_get_hwseq_no(adapter);
	pxmitpriv->nqos_ssn = 0;
}

void rtl8730a_rxdesc2attribute(struct rx_pkt_attrib *a, u8 *desc)
{
	/* initial value */
	_rtw_memset(a, 0, sizeof(struct rx_pkt_attrib));
	a->bw = CHANNEL_WIDTH_MAX;

	a->crc_err = (u8)GET_RX_DESC_CRC32_8730A(desc);
	a->icv_err = (u8)GET_RX_DESC_ICV_ERR_8730A(desc);
	a->drvinfo_sz = (u8)GET_RX_DESC_DRV_INFO_SIZE_8730A(desc) * 8;
	a->physt = (u8)GET_RX_DESC_PHYST_8730A(desc);
	a->encrypt = (u8)GET_RX_DESC_SECURITY_8730A(desc);
	a->qos = (u8)GET_RX_DESC_QOS_8730A(desc);
	a->bdecrypted = (u8)GET_RX_DESC_SWDEC_8730A(desc) ? 0 : 1;
	a->shift_sz = (u8)GET_RX_DESC_SHIFT_8730A(desc);

	a->priority = (u8)GET_RX_DESC_TID_8730A(desc);
	a->mdata = (u8)GET_RX_DESC_MD_8730A(desc);
	a->mfrag = (u8)GET_RX_DESC_MF_8730A(desc);

	a->seq_num = (u16)GET_RX_DESC_SEQ_8730A(desc);
	a->frag_num = (u8)GET_RX_DESC_FRAG_8730A(desc);

