StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/hal/rtl8730a/rtl8730a_ops.c
	/* Get from RX DESC */
	a->pkt_rpt_type = GET_RX_DESC_C2H_8730A(desc) ? C2H_PACKET : GET_RX_DESC_PKT_INDICATE_8730A(desc);

	if (a->pkt_rpt_type == NORMAL_RX) {
		a->amsdu = (u8)GET_RX_DESC_AMSDU_8730A(desc);

		a->ppdu_cnt = (u8)GET_RX_DESC_PPDU_CNT_8730A(desc);
		a->ampdu = (u8)GET_RX_DESC_PAGGR_8730A(desc);
		a->ampdu_eof = (u8)GET_RX_DESC_PPDU_CNT_8730A(desc);
		a->free_cnt = (u32)GET_RX_DESC_TSFL_8730A(desc);

#ifdef CONFIG_TCP_CSUM_OFFLOAD_RX
		/* RX TCP checksum offload related variables */
		a->csum_valid = (u8)GET_RX_DESC_CHK_VLD_8730A(desc);
		a->csum_err = (u8)GET_RX_DESC_CHKERR_8730A(desc);
#endif /* CONFIG_TCP_CSUM_OFFLOAD_RX */
	}

	switch (a->pkt_rpt_type) {
	case NORMAL_RX:
	case C2H_PACKET:
		a->pkt_len = (u16)GET_RX_DESC_PKT_LEN_8730A(desc);
		break;
	case CH_INFO_NDPA:
	case CH_INFO_RSP:
		a->pkt_len = (u16)GET_RX_DESC_CH_INFO_CSI_LEN_8730A(desc) * 8;
		break;
	case PPDU_STATUS:
		a->pkt_len = (u16)GET_RX_DESC_PHYSTS_LEN_8730A(desc) * 8;
		break;
	}

	a->data_rate = (u8)GET_RX_DESC_RX_RATE_8730A(desc);
}

void rtl8730a_query_rx_desc(union recv_frame *precvframe, u8 *pdesc)
{
	rtl8730a_rxdesc2attribute(&precvframe->u.hdr.attrib, pdesc);
}

void rtl8730a_set_hal_ops(PADAPTER adapter)
{
	struct hal_com_data *hal;
	struct hal_ops *ops;


	hal = GET_HAL_DATA(adapter);
	ops = &adapter->hal_func;

	/*
	 * Initialize hal_com_data variables
	 */
	hal->efuse0x3d7 = 0xFF;
	hal->efuse0x3d8 = 0xFF;
	hal->dma_ch_map[QSLT_BEACON] = HALMAC_DMA_CH_BCN;
	hal->dma_ch_map[QSLT_CMD] = HALMAC_DMA_CH_H2C;
	/*
	 * Initialize operation callback functions
	 */
	/*** initialize section ***/
	ops->read_chip_version = read_chip_version;
	/*
		ops->init_default_value = NULL;
		ops->intf_chip_configure = NULL;
	*/
	ops->fw_en = rtl8730a_FirmwareEnable;

	ops->read_adapter_info = rtl8730a_read_efuse;
	ops->hal_power_on = rtl8730a_power_on;
	ops->hal_power_off = rtl8730a_power_off;
	//ops->hal_init = rtl8730a_init;
	ops->hal_deinit = rtl8730a_deinit;
	ops->dm_init = rtl8730a_phy_init_dm_priv;
	ops->dm_deinit = rtl8730a_phy_deinit_dm_priv;

	/*** xmit section ***/
	/*
		ops->init_xmit_priv = NULL;
		ops->free_xmit_priv = NULL;
		ops->hal_xmit = NULL;
		ops->mgnt_xmit = NULL;
		ops->hal_xmitframe_enqueue = NULL;
	#ifdef CONFIG_XMIT_THREAD_MODE
		ops->xmit_thread_handler = NULL;
	#endif
	*/
	ops->run_thread = rtl8730a_run_thread;
	ops->cancel_thread = rtl8730a_cancel_thread;

	/*** recv section ***/
	/*
		ops->init_recv_priv = NULL;
		ops->free_recv_priv = NULL;
	#if defined(CONFIG_USB_HCI) || defined(CONFIG_PCI_HCI)
		ops->inirp_init = NULL;
		ops->inirp_deinit = NULL;
	#endif
	*/
	/*** interrupt hdl section ***/
	/*
		ops->enable_interrupt = NULL;
		ops->disable_interrupt = NULL;
	*/
	ops->check_ips_status = check_ips_status;
	/*
	#if defined(CONFIG_PCI_HCI)
		ops->interrupt_handler = NULL;
	#endif
	#if defined(CONFIG_USB_HCI) && defined(CONFIG_SUPPORT_USB_INT)
		ops->interrupt_handler = NULL;
	#endif
	#if defined(CONFIG_PCI_HCI)
		ops->irp_reset = NULL;
	#endif
	*/

	/*** DM section ***/
	ops->set_chnl_bw_handler = rtl8730a_set_channel_bw;

	ops->set_tx_power_level_handler = rtl8730a_set_tx_power_level;
	ops->set_txpwr_done = rtl8730a_set_txpwr_done;
	ops->set_tx_power_index_handler = rtl8730a_set_tx_power_index;
	ops->get_tx_power_index_handler = hal_com_get_txpwr_idx;

	ops->hal_dm_watchdog = rtl8730a_phy_haldm_watchdog;

	ops->set_hw_reg_handler = rtl8730a_sethwreg;
	ops->GetHwRegHandler = rtl8730a_gethwreg;
	ops->get_hal_def_var_handler = rtl8730a_gethaldefvar;
	ops->SetHalDefVarHandler = rtl8730a_sethaldefvar;

	ops->GetHalODMVarHandler = GetHalODMVar;
	ops->SetHalODMVarHandler = SetHalODMVar;

	ops->SetBeaconRelatedRegistersHandler = set_beacon_related_registers;

	/*
		ops->interface_ps_func = NULL;
	*/
	ops->read_bbreg = rtl8730a_read_bb_reg;
	ops->write_bbreg = rtl8730a_write_bb_reg;
	ops->read_rfreg = rtl8730a_read_rf_reg;
	ops->write_rfreg = rtl8730a_write_rf_reg;
	ops->read_wmmedca_reg = rtl8730a_read_wmmedca_reg;

#ifdef CONFIG_HOSTAPD_MLME
	/*
		ops->hostap_mgnt_xmit_entry = NULL;
	*/
#endif
	/*
		ops->EfusePowerSwitch = NULL;
		ops->BTEfusePowerSwitch = NULL;
		ops->ReadEFuse = NULL;
		ops->EFUSEGetEfuseDefinition = NULL;
		ops->EfuseGetCurrentSize = NULL;
		ops->Efuse_PgPacketRead = NULL;
		ops->Efuse_PgPacketWrite = NULL;
		ops->Efuse_WordEnableDataWrite = NULL;
		ops->Efuse_PgPacketWrite_BT = NULL;
	*/
#ifdef DBG_CONFIG_ERROR_DETECT
	ops->sreset_init_value = sreset_init_value;
	ops->sreset_reset_value = sreset_reset_value;
	ops->silentreset = sreset_reset;
	ops->sreset_xmit_status_check = xmit_status_check;
	ops->sreset_linked_status_check = linked_status_check;
	ops->sreset_get_wifi_status = sreset_get_wifi_status;
	ops->sreset_inprogress = sreset_inprogress;
#endif /* DBG_CONFIG_ERROR_DETECT */

#ifdef CONFIG_IOL
	/*
		ops->IOL_exec_cmds_sync = NULL;
	*/
#endif

	ops->hal_notch_filter = rtl8730a_notch_filter_switch;
	ops->hal_mac_c2h_handler = rtl8730a_c2h_handler;
	ops->fill_h2c_cmd = rtl8730a_fillh2ccmd;
	ops->fill_fake_txdesc = fill_fake_txdesc;

#if defined(CONFIG_WOWLAN) || defined(CONFIG_AP_WOWLAN) || defined(CONFIG_AXI_HCI)
	/*
		ops->clear_interrupt = NULL;
	*/
#endif
	/*
		ops->hal_get_tx_buff_rsvd_page_num = NULL;
	*/
#ifdef CONFIG_GPIO_API
	/*
		ops->update_hisr_hsisr_ind = NULL;
	*/
#endif

	/* HALMAC related functions */
	ops->init_mac_register = rtl8730a_phy_init_mac_register;
	ops->init_phy = rtl8730a_phy_init;
	ops->reqtxrpt = rtl8730a_req_txrpt_cmd;
}
